[
  {
    "name": "Tomoko Kuroki",
    "anime": "WataMote",
    "image": "tomoko.png",
    "description": "Tomoko Kuroki (黒木 智子 Kuroki Tomoko) is the lead protagonist of No Matter How I Look At It, It's You Guys Fault I'm Not Popular! (\"Watamote\"). Socially inept and often desperate, the series chronicles her various attempts to try to be more popular at her school, Makuhari Shuuei High School. She is 15 years old at the time of the series' debut and was born towards the end of February of either 1994, 1997, or 1998.\n<h2>Character Overview</h2>Tomoko started off very excited about high school. After all, she had had over 50 years of dating experience with over 100 boys in otome games, and she could not have been more enthralled with the years of popularity her secondary education was bound to bring! However, after going two months without speaking to anyone in her class, Tomoko is baffled by her continuing lack of notoriety and becomes more determined than ever to gain her peers' approval. In both the manga and anime, Tomoko debuts looking up the definition of \"unpopular girl\"--\"mojyo\" spelled in the English titles later--on the internet only to discover she fits all of the criteria! In the anime opening titles, she is depicted as a prisoner having her pictures taken wearing a placard that identifies her as \"mojyo\" in English letters.\n<h2>Personality</h2>Tomoko has a grim outlook on life - so much that during a daydream she imagines herself on a motorcycle, only to crash and end up in the hospital. She utters a \"censored\" with a tone reference to the anime Gantz, hoping her world will be destroyed and replaced. As the initial series progresses, Tomoko tries to become popular by coming up with ideas on how to get attention. She usually either fails or receives negative attention. She often lacks a \"filter\" in that she will say what she thinks without considering the consequences.",
    "sourceUrl": "https://watamote.fandom.com/wiki/Tomoko_Kuroki",
    "animeUrl": "https://myanimelist.net/anime/16742/Watashi_ga_Motenai_no_wa_Dou_Kangaetemo_Omaera_ga_Warui"
  },
  {
    "name": "Shiro",
    "anime": "No Game No Life",
    "image": "shiro.jpg",
    "description": "Shiro (白しろ, Shiro) is the main female protagonist of the No Game No Life series and the calm and calculative half of the siblings.\nAbandoned by her parents, Shiro is an 11 year old genius NEET (Not in Education, Employment, or Training) hikikomori (shut-in) gamer who, along with her step-brother, Sora, form 『　　』 (Blank). Sora's dad married Shiro's mother, both having remarried, thus making Shiro and Sora step-siblings.\n<h2>Appearance</h2>Shiro is a pale-skinned girl with very long messy white hair with a pale blue, purple, pink, green, and yellow tint and large, passive golden/yellow-red eyes. She is rather slim and about average height (for an eleven-year-old).\n\nShe often wears a purple sailor uniform which may be a bit oversized, along with thigh high stockings.\n<h2>Personality</h2>Shiro is described as a genius in logic and problems, but has difficulty understanding emotions or behavior, relying on Sora to help her defeat beings with emotions such as Tet in their chess match. She also rarely shows much emotion at all and, despite her genius intellect, speaks in short, terse sentences and in a third-person perspective.\n<h2>Strengths</h2>Shiro has shown to be a genius with an almost supernatural intelligence, with incredible scientific calculation and simulation abilities. Like her brother, she possesses eidetic memory and is able to learn and recall a vast amount of information quickly and accurately. Sora has stated that she has beaten a chess program written to beat a grandmaster twenty times in a row, and she herself has stated that chess is no different from Tic-Tac-Toe. It has also been stated by Sora that she fluently speaks 18 languages, and learned to read Imanity in 15 minutes. She is also incredibly skilled in first-person shooters due to her ability to predict the movements and bullet trajectories of her opponents. These predictions are more focused on mathematical probability rather than psychological observation and deduction, unlike Sora.\n<h2>Weaknesses</h2>While a genius, Shiro has trouble dealing with the human aspects of games, like reading human opponents and predicting their moves. Another of her weaknesses is the fact that she can't swim, and is afraid of snakes. A human player doing something unpredictable can unsettle and confuse her, and she relies on Sora to tell her when a human opponent is leading her into a trap, as shown in their chess game with Tet.\n\nShe is also very weak even compared to Human/Imanity girls at the same ages. This is a result of her already-petite body and years of unhealthy lifestyles. Shiro make-up by keeping her physical works at minimum and left said work to others.\n\nHer other weakness is her reliance on Sora. She must be within range of sight and/or sound to Sora or else she'll fall into an almost catatonic state, as shown multiple times in both anime and manga.",
    "sourceUrl": "https://no-game-no-life.fandom.com/wiki/Shiro",
    "animeUrl": "https://myanimelist.net/anime/19815/No_Game_No_Life"
  },
  {
    "name": "Takagi-san",
    "anime": "Karakai Jōzu no Takagi-san",
    "image": "takagi.jpg",
    "description": "Takagi (高木, Takagi) is the main protagonist alongside Nishikata (西片, Nishikata) in Karakai Jōzu no Takagi-san. She is a middle school student who is in the same class as Nishikata, a boy she constantly teases and secretly has feelings for. She is sweet, intelligent, clever, carefree, and fearless whether she is with or without Nishikata. After the 10 year time skips, she is shown to be more mature and responsible for her daughter Chi and the household she and Nishikata live in.\n<h2>Appearance</h2>Takagi is a young girl with a slender build and an average height. She has long, straight brown hair which falls down to her upper back, with middle-parted bangs and two locks of hair framing her face on each side. She has large brown eyes, thin eyebrows, rosy cheeks, and a light complexion. For school, she wears her spring/summer sailor uniform. For autumn/winter, she wears a long sleeve uniform with a red bow tie, blue skirt, black socks, and brown clogs. For P.E., she wears a shirt with red coloring around the cuffs and neck collar. The P.E. shirt also contains the reading 1-2 just like Nishikata's P.E. shirt. For swimming, she only wears a blue leotard. She also wears casual clothing on weekends and on summer break.\n<h2>Personality</h2>Takagi is a kind-hearted and caring person. Though often teasing and acting mischievously towards her classmate Nishikata, she greatly cares for him and truly enjoys her time with him.\n\nTakagi is seen to be very intelligent, consistently scoring higher grades on tests than her classmates  She wins most of her competitions against Nishikata, even though she doesn't seem to be a competitive person. Due to Nishikata's facial expressions and mannerisms, she is able to easily read his mind and follow-up on what he sees, does, and thinks. Moreover, she does not scare easily, as seen when Nishikata tried to scare her with frightening videos and she barely reacted. Takagi is seen to be knowledgeable in myths, rumors, and romance stories, though whether she actually believes in them is debatable.\n",
    "sourceUrl": "https://karakai-jouzu-no-takagi-san.fandom.com/wiki/Takagi",
    "animeUrl": "https://myanimelist.net/anime/35860/Karakai_Jouzu_no_Takagi-san"
  },
  {
    "name": "Chika Fujiwara",
    "anime": "Kaguya-samawa Kokurasetai",
    "image": "chika.gif",
    "description": "Chika Fujiwara (藤原 千花ふじわら ちか, Fujiwara Chika) is one of the main characters of the series. She is a student at Shuchi'in senior high school and the secretary of the student council in the academy.\n<h2>Origin</h2>Chika is based off of Kuramochi no Miko (車持 皇子), the second suitor from The Tale of the Bamboo Cutter who was tasked with finding the Jeweled Branch from Hourai. Her habit of cheating during games is based off of the fact that her counterpart attempted to present Princess Kaguya with a forgery. Everyone in her family has plant based names that reference the branch in some way.\n\nChika's surname \"Fujiwara\" is based on the actual real life Fujiwara clan who were important figures in Japanese Politics throughout history.\n<h2>Appearance</h2>Chika is a beautiful pale-skinned young girl with silver long hair (pale pink long hair in the anime) that has a small black ribbon on top of her bangs in the middle and blue eyes. She is typically dressed in the Shuchi'in school uniform. While Chika is shorter than Kaguya Shinomiya, she has a larger chest.\n<h2>Personality</h2>Fujiwara is a bubbly and eccentric girl who almost always has a smile on her face. Always looking to have fun with her fellow student council members, she is often the one to come up with strange activities and ideas that entertain herself and the others. Fujiwara is mostly oblivious the atmosphere of the room, resulting in her being an unpredictable element that ruins many of Kaguya Shinomiya's and Miyuki Shirogane's schemes to make the other confess.",
    "sourceUrl": "https://kaguyasama-wa-kokurasetai.fandom.com/wiki/Chika_Fujiwara",
    "animeUrl": "https://myanimelist.net/anime/37999/Kaguya-sama_wa_Kokurasetai__Tensai-tachi_no_Renai_Zunousen"
  },
  {
    "name": "Kaguya Shinomiya",
    "anime": "Kaguya-sama wa Kokurasetai",
    "image": "kaguya.png",
    "description": "Kaguya Shinomiya (四宮しのみや かぐや, Shinomiya Kaguya) is the titular character of the series and main female protagonist. She is a second year student at Shuchi'in senior highschool and the vice president of the student council in the academy.<h2>Origin</h2>Kaguya is based off of Nayotake no Kaguya-hime (名夜竹の輝夜姫), the main character of The Tale of the Bamboo Cutter. Her cold personality is based off of Aka Akasaka's interpretation of how Kaguya-hime charged her many suitors with impossible tasks<h2>Appearance</h2>Kaguya is a beautiful young girl with long black hair, white skin, a slim build, red eyes, and always has her hair tied with a ribbon. In the past before, she entered the student council and has always worn her hair down without the iconic red ribbon. It is yet unrevealed if there is an extensive history behind this change in image. She is typically dressed in the Shuchi'in school uniform.<h2>Personality</h2>Kaguya was a very cold and rational individual and only started to warm up to others after joining the student council. After joining the student council, she considered Miyuki Shirogane as one she would be fine to be in a relationship with if, and only if, he confesses first, thus she constantly plays mind games in trying to get Miyuki to confess. Later in the series her actions imply that she is starting to accept her feelings of liking Miyuki, but she still doesn't openly admit it.",
    "sourceUrl": "https://kaguyasama-wa-kokurasetai.fandom.com/wiki/Kaguya_Shinomiya",
    "animeUrl": "https://myanimelist.net/anime/37999/Kaguya-sama_wa_Kokurasetai__Tensai-tachi_no_Renai_Zunousen"
  },
  {
    "name": "Ai Hayasaka",
    "anime": "Kaguya-sama wa Kokurasetai",
    "image": "ai_hayasaka.png",
    "description": "Ai Hayasaka (早坂 愛はやさか あい, Hayasaka Ai) is a supporting character in the series. She is a second year student in Shuchi'in highschool and an employee under the Shinomiya family as Kaguya Shinomiya's personal valet.\n<h2>Origin</h2>Ai is based off of the celestial envoy from The Tale of the Bamboo Cutter who was tasked with returning Kaguya-hime to the moon. This is reflected in the star pattern that can be found on most of her personal belongings.\n<h2>Appearance</h2>Ai is a beautiful young girl with blonde hair that is most usually hair tied up at the left side of her head (She lets her hair down with a small braid tied on the right side when she's disguising as Haysaca A. Smithee) and blue eyes. Her expressions are flexible depending on the need and can express any emotion ranging from a cold stare to a look of pure love. She typically wears the Shuchi'in school uniform — albeit slightly modified to give it a fashionable look.\n<h2>Personality</h2>Ai is a young girl that can adopt multiple personalities to suit the situation, most notably her gal mode and Firis high school mode. Not many people know about her true personality and it is apparently similar to Kaguya Shinomiya's personality. Despite being a part of the Shinomiya house, she is more loyal to Kaguya and acts more in the interest of Kaguya's happiness than to the Shinomiya house itself, going so far as to directly disobey orders from higher ups and disguising herself as Kaguya to let her enjoy the summer fireworks once.\n<h2>History</h2>The Hayasaka family was once prominent, but lost their conflict to the Shinomiya family and, noted for their fine bloodline, were absorbed into it. Ai was born in the Shinomiya family's main house as a thoroughbred servant and was given a special education. She was born into and grew up in an isolated world like Kaguya Shinomiya was, but Ai is less sheltered.",
    "sourceUrl": "https://kaguyasama-wa-kokurasetai.fandom.com/wiki/Ai_Hayasaka",
    "animeUrl": "https://myanimelist.net/anime/37999/Kaguya-sama_wa_Kokurasetai__Tensai-tachi_no_Renai_Zunousen"
  },
  {
    "name": "Megumin",
    "anime": "Kono Subarashii Sekai ni Shukufuku wo!",
    "image": "megumin.png",
    "description": "Megumin (めぐみん) is an Arch Wizard of the Crimson Demon Clan in the Fantasy World, and is the first person to join Kazuma's party. She is one of the main characters of the KonoSuba series.\n<h2>Appearance</h2>Megumin is a young girl with shoulder-length dark brown hair (smooth black in light novel) and crimson-colored eyes. She wears a classical witch attire such as a black cloak with gold border, choker, wizard's hat, fingerless gloves, and carries a black staff. Though she jokingly claims that her eyepatch seals her immense power, she sees it as a stylish sense of fashion due to her chuunibyou tendencies.\n<h2>Personality</h2>Megumin is a straightforward girl, who speaks in an old-style Japanese dialect. She can be very hyper and lively at times and has chuunibyou tendencies like the rest of the Crimson Demon villagers. She is very intelligent, but has very little self-control, especially when it comes to using Explosion magic. She has no problem wasting her spell on empty plains or abandoned castles, as long as she can use Explosion once a day.\n<h2>History</h2>She decided to become an Explosion mage after a busty older woman saved her with Explosion magic when she was young, and after learning it claims she \"must cast Explosion once a day or die.\"\n\nWhile still attending school, Megumin would swindle food from Yunyun every day since her parents couldn't afford meals. Due to her exceptional academic performance, Megumin was able to graduate early. When she left to travel alone, Yunyun predicted she would be \"at a loss due to a lack in the means of survival, begging a useless guy for a meal.\"\n\nAfter traveling to Axel Town, she quickly gained a reputation as a crazy Explosion fanatic, thus parties refused to accept her before meeting Kazuma and Aqua.\n<h2>Abilities</h2>Megumin is absolutely obsessed with Explosion magic. She devotes all of her skill points into improving the power of her explosions, shortening her casting time, and being able to cast the spell without chanting out loud. However, the severe mana drain, combined with Megumin never using points to increase her mana, results in her always collapsing after casting and becoming completely immobile. Also, her refusal to learn any other magic makes her entirely dependent on allies after casting. This is especially notable because there are other known Arch Wizards who can use Explosion magic can remain standing after casting, know at least one other skill, and can fight alone if necessary.",
    "sourceUrl": "https://konosuba.fandom.com/wiki/Megumin",
    "animeUrl": "https://myanimelist.net/anime/30831/Kono_Subarashii_Sekai_ni_Shukufuku_wo"
  },
  {
    "name": "Darkness",
    "anime": "Kono Subarashii Sekai ni Shukufuku wo!",
    "image": "darkness.png",
    "description": "Dustiness Ford Lalatina (ダスティネス・フォード・ララティーナ), usually known as Darkness (ダクネス), is one of three female protagonists of the KonoSuba series. She is a crusader with masochist tendencies who joins Kazuma's party early on.\n<h2>Appearance</h2>A tall, beautiful young woman, Darkness gives the appearance of a cool beauty. She is well-endowed and also has light blue eyes and straight, long blonde hair, usually kept in a ponytail tied with a braid and red hair clips secured on both sides of her bangs. She is usually seen clad in black, white, and yellow armour, with a metal shoulder plate on her left side, and a wing-like cloth perched upon her right shoulder.\n<h2>Personality</h2>As a crusader, Darkness initially presents herself with an aura of pride and nobility, preaching about her duty to shield others from harm. She speaks in a very serious tone of voice and often comes off as very mature.\n\nDespite these outward appearances, however, it does not take long for Darkness to reveal her true character: that of a complete masochist. While she does want to protect others, her masochistic urges are what ultimately drive her to commit many of her “heroic” acts throughout the series, resulting in many onlookers viewing her as a role model for her supposed selflessness. Her masochism extends to verbal abuse as well, a running gag being how she often responds to Kazuma’s sharp insults with her reeling back in pleasure. Throughout the story, she becomes progressively more open about her true intentions, to the point where she blatantly reveals her reason for becoming a crusader was in hopes of being sexually tortured by the Demon King, and that her ideal husband is an abusive alcoholic who would force her to sell her body for money.\n<h2>History</h2>Darkness rarely talked about herself or her background. When she does talk, it is usually about her twisted fantasies. However, we get some subtle hints that she has a high-class background, such as how she conducted herself (when she is not in her masochistic mode) or how her family sent them the very expensive snow crabs as a house-warming gift.\n\nWe later learned that she is a high noble, belonging to the prestigious Dustiness family. While Darkness disapproves of abusing her high position, showing her family badge alone will get immediate obedience from most officials and knights. In LN 8, she started to serve as the acting lord of Axel town in her father's stead, after the previous lord mysteriously disappeared, thought to be in hiding from his criminal and corruption charges.",
    "sourceUrl": "https://konosuba.fandom.com/wiki/Darkness",
    "animeUrl": "https://myanimelist.net/anime/30831/Kono_Subarashii_Sekai_ni_Shukufuku_wo"
  },
  {
    "name": "Aqua",
    "anime": "Kono Subarashii Sekai ni Shukufuku wo!",
    "image": "aqua.jpg",
    "description": "Aqua (アクア) is one of the main characters of the KonoSuba series. Prior to life in the Fantasy World, she was a goddess of water who guided humans to the afterlife; within, she is worshipped by the Axis Order.\n<h2>Appearance</h2>Aqua is described as being such a supernaturally beautiful god that Kazuma notes her beauty being \"beyond the idols shown on television\" and \"surpassing humans\".\n\nShe has a slim figure with ample breasts, long legs, blue waist-long hair that is partially tied into a loop with a water-molecule shaped clip. Aqua's clothes carry a blue color scheme, with her ordinary attire consisting of a vest, detached sleeves, thigh-high boots, an extremely short miniskirt, and a transparent underskirt. She also wears a divine relic in the form of a translucent pink hagoromo, which can disappear and reappear around her at her will.\n<h2>Personality</h2>Aqua has an interesting yet troublesome personality. She is high-spirited, cheerful, and carefree, but rarely thinks about the consequences of her actions. While she doesn't force her beliefs onto others, Aqua always acts or speaks on her whims; so, she can behave very inappropriately in many situations. It is also very easy to taunt Aqua with jeers or lure her with praises. Since Aqua, as a goddess, thrives on praise/worship points, she usually performs good deeds, but then immediately ruins her own merits by seeking praises aggressively and persistently. Also, while many of her 'good deeds' turn out fine, Aqua is very short-sighted, and some of these \"good deeds\" actually turn out to be complete disasters.\n<h2>History</h2>Aqua is worshiped by the Axis Order in the Fantasy World. Though hundreds of years had been passing in the Fantasy World since she started sending Japanese people there before being dragged to it herself by Kazuma, because of the difference in which time passes between the fantasy world and heaven she says to Kazuma that she has barely lived a bit longer than him.",
    "sourceUrl": "https://konosuba.fandom.com/wiki/Aqua",
    "animeUrl": "https://myanimelist.net/anime/30831/Kono_Subarashii_Sekai_ni_Shukufuku_wo"
  },
  {
    "name": "Meiko Honma",
    "anime": "Ano Hi Mita Hana no Namae wo Bokutachi wa Mada Shiranai",
    "image": "menma.jpg",
    "description": "Meiko Honma, who is also called by her nickname Menma, is the female protagonist in the story whose ghost shows up to Jinta Yadomi because of her wish that he and his friends must grant. She is a childlike girl who was part of the Super Peace Busters before she died because of an accident.\n<h2>Appearance</h2>As a child, Meiko appears as a small 5-year-old little girl with long, straight, silver hair that reaches past her shoulders with her bangs cut fringed on top of her forehead. Her eyes are light blue and wide, making her look like a cheerful, innocent child.\n<h2>Personality</h2>Menma is a very kind and cheerful girl with a very air-headed nature and she often worries about others before herself, especially when it comes to Jinta \"Jintan\" Yadomi. She is extremely childish (although this may partially be down to the fact she died as a child and has only recently been 'resurrected').\n<h2>History</h2>On some particular day in their hideout, Naruko \"Anaru\" Anjou asked Jinta \"Jintan\" Yadomi if he liked Menma. With this question he felt embarrassed and acted impulsively, calling Menma \"ugly\" and ran out. Instead of crying, Menma smiled and chased the embarrassed Jinta. It was never actually shown what happened to Menma, but the anime indicates that she slipped and fell while chasing Jinta and drowned in a river nearby.",
    "sourceUrl": "https://anohana.fandom.com/wiki/Meiko_%22Menma%22_Honma",
    "animeUrl": "https://myanimelist.net/anime/9989/Ano_Hi_Mita_Hana_no_Namae_wo_Bokutachi_wa_Mada_Shiranai"
  },
  {
    "name": "Kiyoko Shimizu",
    "anime": "Haikyuu!!",
    "image": "kiyoko_shimizu.jpg",
    "description": "Kiyoko Shimizu (Japanese: 清水 潔子しみず きよこ Shimizu Kiyoko) is one of the managers of the Karasuno High volleyball club.\n<h2>Appearance</h2>Kiyoko is a pale-skinned girl with shoulder-length black hair, grey eyes, a distinctive mole on the lower left side of her chin, pink square glasses and a slender build.\n\nShe is commonly described as an attractive girl who garners attention from both male and female students. She has a slender build and has been described as \"somewhat erotic\" multiple times. Because of her appearance, Karasuno High is generally known as the team with the beautiful manager. \n<h2>Personality</h2>Although Kiyoko is a generally quiet girl who doesn't express her thoughts often, she is a serious and passionate girl about her position as a team manager and was reluctant to step down from the club after the Interhigh. She cares a lot about the members, going out of her way to fix and wash Karasuno High's old banner to boost the team's morale and recruiting a manager on her own so the underclassmen won't have to worry about it next year.\n<h2>Background</h2>Kiyoko was previously a member of her middle school's track and field team who specialized in hurdles and as a result, injured her legs often. Because of the team's large size and her inability to talk to others, she wasn't particularly close to any of the juniors. She eventually retired from the sport for unknown reasons.\n\nIn her first year of high school, she was recruited by Daichi to become the manager for Karasuno's Boys' Volleyball Club.",
    "sourceUrl": "https://haikyuu.fandom.com/wiki/Kiyoko_Shimizu",
    "animeUrl": "https://myanimelist.net/anime/20583/Haikyuu"
  },
  {
    "name": "Hestia",
    "anime": "Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka",
    "image": "hestia.png",
    "description": "Hestia (ヘスティア) is a Goddess and head of the Hestia Familia.\n<h2>Appearance</h2>Hestia is a beautiful and petite Goddess with a youthful appearance. She has blue eyes and mid-thigh length black hair tied into two twin tails which reach down to her mid thighs. Her hair is tied with hair accessories that feature blue and white petals along with bell shaped ornaments. She has a small frame (4' 7\"), which further emphasizes her breasts, hence the nickname \"Loli Big-boobs.\" Her usual attire is a white mini dress with a blue ribbon around her neck and one tied under her breasts around her arms, and a pair of white gloves. She is usually barefoot, but occasionally wears a pair of white flip-flops.\n<h2>Personality</h2>Hestia is a kind and energetic Goddess. She also dreams of being in a relationship with Bell and sees Ais and the other girls as her love rivals. Despite this, she does acknowledge the children of the lower world. Hestia is also a hard worker, working two jobs just to pay off her debt for the Hestia Knife. However, she also has somewhat of a lazy side as she stayed with Hephaestus until she was forced out and later took a while to find work.\n<h2>History</h2>After descending to the Lower World, Hestia was taken care of by her friend Hephaestus. Soon after, she was asked to live on her own after she kept freeloading off of Hephaetus's familia and was given a room at an abandoned church.\n\nHestia tried to create her own familia, but wasn't able to recruit anyone. After failing to recruit for the 50th time, she noticed Bell and decided to secretly follow him. Hestia found out that Bell had been trying to enter a familia, but was rejected multiple times and seemed to be in the same boat. Hestia then took the chance to recruit him, which Bell happily agreed upon; becoming the first member of her familia. She took Bell to a bookstore, the location she already decided beforehand, and granted her Falna to her first dependent.",
    "sourceUrl": "https://danmachi.fandom.com/wiki/Hestia",
    "animeUrl": "https://myanimelist.net/anime/28121/Dungeon_ni_Deai_wo_Motomeru_no_wa_Machigatteiru_Darou_ka"
  },
  {
    "name": "Rem",
    "anime": "Re:Zero kara Hajimeru Isekai Seikatsu",
    "image": "rem.png",
    "description": "Rem (レム) is one of the twin maids working for Roswaal L Mathers.\n<h2>Appearance</h2>Rem has medium length sky blue hair that covers her right eye, large light blue eyes, and young features. She also has hair clips towards left side of her hair, flower-shaped ribbon on the same side of her hair, and a maid hairband. She looks nearly identical to her sister apart from her hair, eyes, and ribbon coloring. She usually wears a maid uniform, and since her chest is slightly larger than her sister's, she secretly changes the measurements to hide it.\n<h2>Personality</h2>Rem tends to speak in a superficially polite manner and sometimes acts without thinking. She holds both respect to the point of worship and guilt toward her sister for an incident in the past. Because of her respect and guilt toward her sister, she used to think of herself as inferior. After Subaru saves her, she falls deeply in love with him, becoming one of his most loyal followers. Rem will stick with him no matter what happens, even if Subaru rejects himself.\n\nCurrently Rem has had her name and memories eaten by Ley Batenkaitos, erasing her existence from the world and putting her in suspended animation.\n<h2>History</h2>Rem lived along with her father, mother, and her elder sister Ram in an Oni village. Initially, because they were born with one horn each it meant they were defective in the view of the Oni community whom believe individual strength above all else and were despised for it. They were to be killed as the custom of Oni to protect their pride as strongest of the demi-humans, until just before the execution Ram displayed the potential of her power to protect them both at which shocked the community. Being allowed to live thanks to her older sister who had an aptitude that had not been seen in a millennia among Oni kind, Rem spent rest of her days in her shadow. Despite presence of her sister also raising expectation for herself in the community, she could never meet them nor surpass her sister in any area which earned her disappoint from the other villagers. However Rem loved her sister and accepted her place behind and very least her parents still cared for them both deeply even if she herself found difficult to believe in front of the brilliance of her older sister. One night Rem's life change forever when it got attacked by the Witch Cult around 6 years before the beginning of the story, following into her sister's horn being cut off by Faust. The whole village got destroyed along with her parents and the citizens, except for her and Ram.",
    "sourceUrl": "https://rezero.fandom.com/wiki/Rem",
    "animeUrl": "https://myanimelist.net/anime/31240/Re_Zero_kara_Hajimeru_Isekai_Seikatsu"
  },
  {
    "name": "Emilia",
    "anime": "Re:Zero kara Hajimeru Isekai Seikatsu",
    "image": "emilia.png",
    "description": "Emilia (エミリア) is the main heroine of the Re:Zero kara Hajimeru Isekai Seikatsu series. She is a Half Elf and a candidate to become the 42nd King of Lugnica. After Arc 4, Subaru officially becomes her knight.\n<h2>Appearance</h2>Emilia is a beautiful Half Elf with long silver hair and purple blue eyes. She wears a white and purple outfit along with a white flower in her hair. Throughout the series, she has styled her hair in a variety of ways.\n\nWhen Emilia still lived in Elior Forest and was younger, she had a different set of clothes, with the same color pattern. She had a light green ribbon instead of her necklace, a different flower in her hair, and a hairband in her hair.\n<h2>Personality</h2>Emilia is good natured and likes to take care of others, though she herself refuses to admit it, instead thinking of it as her own selfishness. As a result, this often has Emilia avoid opening up to others and sharing her burdens to a very stubborn degree. She is indifferent to her own appearance, leaving Puck to take care of her clothes and hair. Because her appearance is similar to the Witch of Envy, she has received harsh discrimination from others.\n\nShe has a tendency to use a lot of antiquated words that you would only hear out of an old person. On rare occasions, Emilia will let out her childish side when faced with something very unfamiliar to her because up until a few years ago she was unacquainted with the social norms of the outside world beyond the woods she used to live in alongside other elves. Despite this, she adapts quickly and still works hard to become a king.\n<h2>History</h2>About a century ago, Emilia lived with her aunt on her father's side in Elior Forest. Back then for reasons not known to her she was considered a rather special child spent most of her days isolated from the other eleven villagers in a place called the \"Princess Room\" with only Fortuna, her doll and spirits for company. While she normally obeyed her aunt and loved her, deep down a part of Emilia resented her and the village for stripping her of freedom, constantly hiding things from her.",
    "sourceUrl": "https://rezero.fandom.com/wiki/Emilia",
    "animeUrl": "https://myanimelist.net/anime/31240/Re_Zero_kara_Hajimeru_Isekai_Seikatsu"
  },
  {
    "name": "Kosaki Onodera",
    "anime": "Nisekoi",
    "image": "onodera.png",
    "description": "Kosaki Miyanagi née Onodera (小野寺 小咲, Onodera Kosaki) is one of the main characters of the Nisekoi series. She is one of the love interest of Raku Ichijō.\n<h2>Background</h2>Kosaki comes from a family of pastry chefs; all of whom specialize in making and decorating candies. However, her father is missing for the most part of the series and is hinted to have his own work to deal with. Thus, Kosaki has since been living with her eccentric mother and her feisty younger sister in their Japanese candy shop. Ironically, despite this environment, she grows up to be very timid by nature.\n<h2>Personality</h2>Kosaki is discreet, innocent, and slightly timid. She is very kind, taking care of Raku Ichijō when he is wounded or ill. Generally, she opts to think carefully before acting, as seen when she stalls her confession to Raku in consideration that he may have feelings for Chitoge Kirisaki.\n\nAt times, Kosaki shows signs of lacking self-confidence and often needs the support of Ruri Miyamoto (Kosaki's best friend). This is also proven by the fact that Kosaki's younger sister is very over-protective of her (even though Kosaki is older than Haru). In confrontations with Raku, Kosaki initially needs encouragement from Ruri to attempt any form of contact as she lacks self-confidence around him. \n<h2>Appearance</h2>Kosaki is a fair-skinned teenage girl with dark brown and shoulder-length with one long strand of hair which she keeps combed neatly to the left side of her face and chocolate brown eyes. Kosaki is average in height and has a thin figure. She looks a lot like her mother. She has the school uniform as most of her classmates do which is a half-sleeved or long-sleeved (depending on the season) white shirt with a blue sailor-style collar attached at the lower part of her neck that connects a thin orange tie that is laced through a loop at the end of the shirt, making a little part of the tie to reach the skirt. The skirt reaches around the upper thighs and is a blue-colored fabric that is accompanied by her white knee-length socks and brown slip-on shoes.",
    "sourceUrl": "https://nisekoi.fandom.com/wiki/Kosaki_Onodera",
    "animeUrl": "https://myanimelist.net/anime/18897/Nisekoi"
  },
  {
    "name": "Chitoge Kirisaki",
    "anime": "Nisekoi",
    "image": "chitoge.png",
    "description": "Chitoge Ichijō (一条 千棘, Ichijō Chitoge; (née Kirisaki (桐崎)) is the main female protagonist of the Nisekoi series. She is the daughter of Adelt Wogner Kirisaki and Hana Kirisaki She served as the fake girlfriend of Raku Ichijō for the next three years of her school life to prevent a war from starting between their families.\n<h2>Appearance</h2>Chitoge is an attractive young woman with stunning features, slim build, and fair skin with a pale complexion. She has beautiful waist-length blond hair with pink tips at the end of her hair and strikingly aqua-blue eyes. Coupled with her height - tall by most standards - and her natural figure, many people associate her with a supermodel. Her most notable feature is the red ribbon that she always uses to tie her hair which was given by her mother. This is from when she was quite young, but she still prefers to wear this specific one though her mother has offered to buy her many more. In the manga, it was noted that her ribbon looked like the one the girl on Kosaki Onodera's picture book had.\n<h2>Personality</h2>Chitoge is somewhat a forgetful, stern and bold girl. However, once someone gets to know her better, she becomes very talkative and nice. Similar to Raku Ichijō, Chitoge is the type to go out of her way to help someone. For example, when Raku lost his pendant once again from the chain being broken, Chitoge had secretly gotten the Beehive gang to help fix it for him and gave it back later that night.\n\nChitoge is somewhat oblivious when it comes to love and others' love interests, for example, how she didn't know what Seishirō Tsugumi’s \"symptoms\" were, which were actually love. She is also very athletic as she can easily jump over the school's walls and swim the length of the school pool in a couple of seconds\n<h2>Background</h2>Chitoge originally lived with Adelt Wogner Kirisaki (Chitoge's father) in the United States until she transferred to another school in Japan, where she is now currently attending. With her father being the leader of the infamous Bee Hive Gang, it has caused multiple problems for Chitoge during her childhood as she was unable to make friends as they disliked her. Being under constant watch by Claude Ringheart (Chitoge's bodyguard), the students from her childhood also disliked her. However, when she was young, she met and befriended a hitwoman in-training named Seishirō Tsugumi, who, to the current day, she is still friends with. Chitoge also seems to have a few problems with her mother, who has very high expectations for her, making Chitoge somewhat of a perfectionist who excels in both sports and academics.",
    "sourceUrl": "https://nisekoi.fandom.com/wiki/Chitoge_Kirisaki",
    "animeUrl": "https://myanimelist.net/anime/18897/Nisekoi"
  },
  {
    "name": "Yuuki Asuna",
    "anime": "Sword Art Online",
    "image": "yuuki_asuna.png",
    "description": "Yuuki Asuna (結城 明日奈, Yūki Asuna), known as Asuna (アスナ, Asuna) in «Sword Art Online» (SAO), «ALfheim Online» (ALO), as well as «Project Alicization», where she had temporarily used the Stacia (ステイシア, Suteishia) account, is the main heroine of the Sword Art Online series, the deuteragonist of the Aincrad Arc, as well as the protagonist of the Mother's Rosario side story. She is the daughter of the former CEO of RECT Inc.. Asuna was one of the 10,000 players trapped in «Sword Art Online», where she was the sub-leader of the «Knights of the Blood» (KoB) guild. Her skills with the rapier had her earned her the nickname «The Flash» (閃光, Senkō).\n<h2>Appearance</h2>Asuna has long, orange-brownish chestnut hair and hazel eyes. In the early levels of SAO, she wore a dark red leather tunic with a lightweight copper breastplate and leather pants with boots up to the knees along with a hooded cape. After joining the «Knights of the Blood», she wore a red and white uniform that all KoB members wear and wielded a rapier made by Lisbeth, called the «Lambent Light». Asuna's avatar as Creation Goddess Stacia maintains her chestnut hair and light brown eyes. She wears armor with a pearly shine and a long skirt consisting of countless fine fabrics.\n<h2>Personality</h2>Asuna originally did not care about dying in the game before meeting Kirito. That meeting drastically changed Asuna's personality and outlook on life. She soon takes most things Kirito says to heart and looks to him for help, using him as somewhat of a lifeline.\n\nAsuna is a kind and helpful young woman who, similarly to Kirito, cannot abandon another in trouble. She takes the game very seriously and is determined to clear it before Kirito tells her to enjoy SAO a bit. Asuna is also somewhat proud and despite her kind personality, she will not hesitate to get physical with those that challenge her authority or make fun of her abilities, such as cooking. She even challenged Kirito to a duel after an argument over how to handle a Field Boss. She is not afraid to act out on her own and will take matters into her own hands from time to time.\n<h2>Background</h2>Asuna lived a comfortable life in her large home in Setagaya with her mother, father, and her brother. She originally went to private, all-girl schools before the events of SAO.\n\nOn November 6, 2022, Asuna logged onto SAO after she borrowed her brother's NerveGear. He had acquired a copy of the game and a NerveGear through his connections but could not play the game on the opening day due to a sudden business trip. When she discovered that she and all of the players were trapped in SAO, she secluded herself inside of her rented room in the «Town of Beginnings» for two weeks before resolving to take her fate into her own hands. This led her to kill monsters at an incredible rate and level up in a quick fashion, even risking her life in the process.",
    "sourceUrl": "https://swordartonline.fandom.com/wiki/Yuuki_Asuna",
    "animeUrl": "https://myanimelist.net/anime/11757/Sword_Art_Online"
  },
  {
    "name": "Kurisu Makise",
    "anime": "Steins;Gate",
    "image": "makise_kurisu.jpg",
    "description": "Kurisu Makise (牧瀬 紅莉栖 Makise Kurisu) is the daughter of Shouichi Makise, a genius girl who graduated from university at the age of seventeen, and a member of the neuroscience laboratory of Viktor Chondria University and the Future Gadget Lab.\n\nKurisu is one of the main characters of Steins;Gate, a major posthumous character in Steins;Gate 0 via Amadeus. She is briefly mentioned in Chaos;Child, and she communicates via the in-universe Twitter (Twipo) in Robotics;Notes and Robotics;Notes DaSH.\n<h2>Appearance</h2>Kurisu is a slender young woman with waist-length, reddish hair, and dull violet eyes. Her hair, which she prefers to let loose, ranges in ginger shades all the way from mahogany to auburn. Her hair color differs considerably in the anime (red) from the original VN (chestnut). The \"Kuri\" part of her name means chestnut, and her hair color is most likely meant to resemble the color of a chestnut.\n<h2>Personality</h2>Kurisu is generally a sensible, serious mature young woman, usually calm and collected even when someone is acting tense in front of her. However, she can also show a much more timid side at times. She is shown frequently to hate being nicknamed, as she dislikes all of the names that Okabe gives her, with 'The Zombie' bugging her most of all. Ironically, on the rare occasions Okabe uses her real name, she takes it as a sign that something is seriously wrong. Kurisu is also practical and a realist, almost to a fault; initially, she believes firmly that time machines are fiction and refuses to believe the Phonewave is one even after seeing it in action, claiming that Okabe had simply seen what he wanted to see. It takes the group's looking up SERN's research about time travel to finally convince Kurisu of the truth. However, in Steins;Gate 0, she doesn't deny the possibility of time machines and will build one herself if she had the materials.",
    "sourceUrl": "https://steins-gate.fandom.com/wiki/Kurisu_Makise",
    "animeUrl": "https://myanimelist.net/anime/9253/Steins_Gate"
  },
  {
    "name": "Mayuri Shiina",
    "anime": "Steins;Gate",
    "image": "mayuri_shiina.png",
    "description": "Mayuri Shiina (椎名 まゆり, Shīna Mayuri), also known as Mayushii☆, is Rintaro Okabe's childhood friend, a part-time worker at May Queen Nyan-nyan and a member of the Future Gadget Lab. She is also an avid cosplay maker and friend of Luka Urushibara and Akiha Rumiho.\n\nDuring the year 2036 in the Beta Attractor Field, Mayuri becomes Kagari Shiina's adoptive mother.\n<h2>Appearance</h2>Mayuri is a short girl with short black hair and lightly blue iris. Her hair forms fringes that sweep from either side. Mayuri's eyebrows are noticeably thick.\n\nMayuri's outfit is simple and comfortable, consisting of a light blue one-piece dress and a hat of the same color. She also wears leggings underneath her clothing.\n\nWhen she attends to her work at May Queen Nyan-nyan, she wears a blonde wig tied into a long ponytail.\n<h2>Personality</h2>Mayuri possesses an extremely childish and naïve attitude for her age. While this may have something to do with her inability to accept the death of her grandmother when she was young, Okabe states at one point that she's always been a little bit different, though he never goes into any detail beyond this. Mayuri has a great fondness for cute things like Upa cushions, and likes to give cute nicknames to familiar people, like Okarin for Okabe, being a portmanteau of his last and first names Okabe Rintaro, even referring to herself as Mayushii, being a portmanteau of Mayuri Shiina.",
    "sourceUrl": "https://steins-gate.fandom.com/wiki/Mayuri_Shiina",
    "animeUrl": "https://myanimelist.net/anime/9253/Steins_Gate"
  },
  {
    "name": "Raphtalia",
    "anime": "Tate no Yuusha no Nariagari",
    "image": "raphtalia.gif",
    "description": "Raphtalia (ラフタリア Rafutaria) (also ambiguously translated as Raftalia) is a Tanuki-type Demi-Human who was the first real member of the Shield Hero's party after he purchased her as a slave. She is now the Katana Hero (刀の勇者 Katana no Yuusha).\n<h2>Appearance</h2>She has undergone some significant changes throughout the story. When Raphtalia is first introduced, she is a child that has long, unmanaged hair and a dirty cloth gown. After being purchased by Naofumi, he gave her a haircut to an acceptable length, gave her a bath, and bought her a much more suitable set of clothes to adventure in. As a Tanuki demi-human, Raphtalia is shown to have fluffy dog-like ears and an averagely sized bushy tail.\n<h2>Personality</h2>Raphtalia was initially very shy, sickly, and fearful as a result of her status as a slave, as well as suffering from trauma with memories of the destruction of her village. After the encounter with the two-headed dog monster, she overcomes the trauma from her parents' death at the hands of the Cerberus and acknowledges Naofumi as a hero in her own mind.\n<h2>Background</h2>Until the age of 10, Raphtalia lived in a small coastal village outside of Melromarc, where everyone lived in harmony until the first wave of calamity attacked. During the attack, Raphtalia and her parents fled their home but considering they could only dive into the sea to escape the monsters Raphtalia's parents made the ultimate sacrifice. Her parents pushed her off a nearby cliff as the wave approached them, and she watched as her parents were engulfed by the Cerberus. Raphtalia survived the fall and went back to find her parents, but was unsuccessful. Shortly thereafter a group of Melromarc Knights came to her village and killed all the adult survivors. They captured all the young ones and sold them to the slave hunters for money.",
    "sourceUrl": "https://shield-hero.fandom.com/wiki/Raphtalia",
    "animeUrl": "https://myanimelist.net/anime/35790/Tate_no_Yuusha_no_Nariagari"
  },
  {
    "name": "Nezuko Kamado",
    "anime": "Kimetsu no Yaiba",
    "image": "nezuko.png",
    "description": "Nezuko Kamado (竈門かまど禰ね豆ず子こ Kamado Nezuko) is the younger sister of Tanjiro Kamado and one of the two remaining members of the Kamado family. Formerly human, she was attacked and turned into a Demon by Muzan Kibutsuji. She is one of the main protagonists of Demon Slayer: Kimetsu no Yaiba.\n<h2>Appearance</h2>Nezuko is a petite young girl with fair skin, visibly large, prominent fangs, and sharp, claw-like nails that fade to red where they point. Her hair is long, dark brown and reaches just below her waist, turning an vermilion color as it passes her elbows, and appears to be crimped into large, straight ridges, worn side-swept drastically to her left. She has soft-looking, pale pink eyes that appear a lighter color around the rims of their irises, slanted downwards towards the sides of her face and framed by notably long eyelashes, the pupils of which can appear slit as she transforms. According to Tanjiro Kamado, Nezuko was known as a great beauty in their home town.\n<h2>Personality</h2>Nezuko's original personality as a human was that of a kind and caring girl, who thought of others before herself much like her older brother, Tanjiro, and was a responsible elder sister to her younger siblings.\n\nAs a Demon, however, Nezuko seems to have forgotten a good portion of her memories as a human, besides those related to her family, and thus doesn't retain the exact personality she had before transformation. She is still very caring and protective towards humans who she sees as members of her family, although this is mainly due to the influence Sakonji Urokodaki had on her while she was asleep for two years. Nezuko also retains some of her human emotions, as she has been seen to cry when sad and smile when happy, but in general she appears more detached than her human cohorts, although she is still much calmer and less malicious than most Demons.\n<h2>History</h2>Nezuko grew up on a mountain alongside her older brother, Tanjiro, and the rest of her siblings and mother, as the eldest daughter of the Kamado family. She presumably took care of her younger siblings as an assistant to her mother, as is briefly witnessed prior to her family's death. Unlike Tanjiro, who was responsible for selling firewood in town, Nezuko would usually help out around the family home.",
    "sourceUrl": "https://kimetsu-no-yaiba.fandom.com/wiki/Nezuko_Kamado",
    "animeUrl": "https://myanimelist.net/anime/38000/Kimetsu_no_Yaiba"
  }
]
