[
  {
    "name": "Tomoko Kuroki",
    "anime": "WataMote",
    "image": "tomoko.png",
    "description": "Tomoko Kuroki (黒木 智子 Kuroki Tomoko) is the lead protagonist of No Matter How I Look At It, It's You Guys Fault I'm Not Popular! (\"Watamote\"). Socially inept and often desperate, the series chronicles her various attempts to try to be more popular at her school, Makuhari Shuuei High School. She is 15 years old at the time of the series' debut and was born towards the end of February of either 1994, 1997, or 1998.\n<h2>Character Overview</h2>Tomoko started off very excited about high school. After all, she had had over 50 years of dating experience with over 100 boys in otome games, and she could not have been more enthralled with the years of popularity her secondary education was bound to bring! However, after going two months without speaking to anyone in her class, Tomoko is baffled by her continuing lack of notoriety and becomes more determined than ever to gain her peers' approval. In both the manga and anime, Tomoko debuts looking up the definition of \"unpopular girl\"--\"mojyo\" spelled in the English titles later--on the internet only to discover she fits all of the criteria! In the anime opening titles, she is depicted as a prisoner having her pictures taken wearing a placard that identifies her as \"mojyo\" in English letters.\n<h2>Personality</h2>Tomoko has a grim outlook on life - so much that during a daydream she imagines herself on a motorcycle, only to crash and end up in the hospital. She utters a \"censored\" with a tone reference to the anime Gantz, hoping her world will be destroyed and replaced. As the initial series progresses, Tomoko tries to become popular by coming up with ideas on how to get attention. She usually either fails or receives negative attention. She often lacks a \"filter\" in that she will say what she thinks without considering the consequences.",
    "sourceUrl": "https://watamote.fandom.com/wiki/Tomoko_Kuroki",
    "animeUrl": "https://myanimelist.net/anime/16742/Watashi_ga_Motenai_no_wa_Dou_Kangaetemo_Omaera_ga_Warui"
  },
  {
    "name": "Shiro",
    "anime": "No Game No Life",
    "image": "shiro.jpg",
    "description": "Shiro (白しろ, Shiro) is the main female protagonist of the No Game No Life series and the calm and calculative half of the siblings.\nAbandoned by her parents, Shiro is an 11 year old genius NEET (Not in Education, Employment, or Training) hikikomori (shut-in) gamer who, along with her step-brother, Sora, form 『　　』 (Blank). Sora's dad married Shiro's mother, both having remarried, thus making Shiro and Sora step-siblings.\n<h2>Appearance</h2>Shiro is a pale-skinned girl with very long messy white hair with a pale blue, purple, pink, green, and yellow tint and large, passive golden/yellow-red eyes. She is rather slim and about average height (for an eleven-year-old).\n\nShe often wears a purple sailor uniform which may be a bit oversized, along with thigh high stockings.\n<h2>Personality</h2>Shiro is described as a genius in logic and problems, but has difficulty understanding emotions or behavior, relying on Sora to help her defeat beings with emotions such as Tet in their chess match. She also rarely shows much emotion at all and, despite her genius intellect, speaks in short, terse sentences and in a third-person perspective.\n<h2>Strengths</h2>Shiro has shown to be a genius with an almost supernatural intelligence, with incredible scientific calculation and simulation abilities. Like her brother, she possesses eidetic memory and is able to learn and recall a vast amount of information quickly and accurately. Sora has stated that she has beaten a chess program written to beat a grandmaster twenty times in a row, and she herself has stated that chess is no different from Tic-Tac-Toe. It has also been stated by Sora that she fluently speaks 18 languages, and learned to read Imanity in 15 minutes. She is also incredibly skilled in first-person shooters due to her ability to predict the movements and bullet trajectories of her opponents. These predictions are more focused on mathematical probability rather than psychological observation and deduction, unlike Sora.\n<h2>Weaknesses</h2>While a genius, Shiro has trouble dealing with the human aspects of games, like reading human opponents and predicting their moves. Another of her weaknesses is the fact that she can't swim, and is afraid of snakes. A human player doing something unpredictable can unsettle and confuse her, and she relies on Sora to tell her when a human opponent is leading her into a trap, as shown in their chess game with Tet.\n\nShe is also very weak even compared to Human/Imanity girls at the same ages. This is a result of her already-petite body and years of unhealthy lifestyles. Shiro make-up by keeping her physical works at minimum and left said work to others.\n\nHer other weakness is her reliance on Sora. She must be within range of sight and/or sound to Sora or else she'll fall into an almost catatonic state, as shown multiple times in both anime and manga.",
    "sourceUrl": "https://no-game-no-life.fandom.com/wiki/Shiro",
    "animeUrl": "https://myanimelist.net/anime/19815/No_Game_No_Life"
  },
  {
    "name": "Takagi-san",
    "anime": "Karakai Jōzu no Takagi-san",
    "image": "takagi.jpg",
    "description": "Takagi (高木, Takagi) is the main protagonist alongside Nishikata (西片, Nishikata) in Karakai Jōzu no Takagi-san. She is a middle school student who is in the same class as Nishikata, a boy she constantly teases and secretly has feelings for. She is sweet, intelligent, clever, carefree, and fearless whether she is with or without Nishikata. After the 10 year time skips, she is shown to be more mature and responsible for her daughter Chi and the household she and Nishikata live in.\n<h2>Appearance</h2>Takagi is a young girl with a slender build and an average height. She has long, straight brown hair which falls down to her upper back, with middle-parted bangs and two locks of hair framing her face on each side. She has large brown eyes, thin eyebrows, rosy cheeks, and a light complexion. For school, she wears her spring/summer sailor uniform. For autumn/winter, she wears a long sleeve uniform with a red bow tie, blue skirt, black socks, and brown clogs. For P.E., she wears a shirt with red coloring around the cuffs and neck collar. The P.E. shirt also contains the reading 1-2 just like Nishikata's P.E. shirt. For swimming, she only wears a blue leotard. She also wears casual clothing on weekends and on summer break.\n<h2>Personality</h2>Takagi is a kind-hearted and caring person. Though often teasing and acting mischievously towards her classmate Nishikata, she greatly cares for him and truly enjoys her time with him.\n\nTakagi is seen to be very intelligent, consistently scoring higher grades on tests than her classmates  She wins most of her competitions against Nishikata, even though she doesn't seem to be a competitive person. Due to Nishikata's facial expressions and mannerisms, she is able to easily read his mind and follow-up on what he sees, does, and thinks. Moreover, she does not scare easily, as seen when Nishikata tried to scare her with frightening videos and she barely reacted. Takagi is seen to be knowledgeable in myths, rumors, and romance stories, though whether she actually believes in them is debatable.\n",
    "sourceUrl": "https://karakai-jouzu-no-takagi-san.fandom.com/wiki/Takagi",
    "animeUrl": "https://myanimelist.net/anime/35860/Karakai_Jouzu_no_Takagi-san"
  },
  {
    "name": "Chika Fujiwara",
    "anime": "Kaguya-samawa Kokurasetai",
    "image": "chika.gif",
    "description": "Chika Fujiwara (藤原 千花ふじわら ちか, Fujiwara Chika) is one of the main characters of the series. She is a student at Shuchi'in senior high school and the secretary of the student council in the academy.\n<h2>Origin</h2>Chika is based off of Kuramochi no Miko (車持 皇子), the second suitor from The Tale of the Bamboo Cutter who was tasked with finding the Jeweled Branch from Hourai. Her habit of cheating during games is based off of the fact that her counterpart attempted to present Princess Kaguya with a forgery. Everyone in her family has plant based names that reference the branch in some way.\n\nChika's surname \"Fujiwara\" is based on the actual real life Fujiwara clan who were important figures in Japanese Politics throughout history.\n<h2>Appearance</h2>Chika is a beautiful pale-skinned young girl with silver long hair (pale pink long hair in the anime) that has a small black ribbon on top of her bangs in the middle and blue eyes. She is typically dressed in the Shuchi'in school uniform. While Chika is shorter than Kaguya Shinomiya, she has a larger chest.\n<h2>Personality</h2>Fujiwara is a bubbly and eccentric girl who almost always has a smile on her face. Always looking to have fun with her fellow student council members, she is often the one to come up with strange activities and ideas that entertain herself and the others. Fujiwara is mostly oblivious the atmosphere of the room, resulting in her being an unpredictable element that ruins many of Kaguya Shinomiya's and Miyuki Shirogane's schemes to make the other confess.",
    "sourceUrl": "https://kaguyasama-wa-kokurasetai.fandom.com/wiki/Chika_Fujiwara",
    "animeUrl": "https://myanimelist.net/anime/37999/Kaguya-sama_wa_Kokurasetai__Tensai-tachi_no_Renai_Zunousen"
  },
  {
    "name": "Kaguya Shinomiya",
    "anime": "Kaguya-sama wa Kokurasetai",
    "image": "kaguya.png",
    "description": "Kaguya Shinomiya (四宮しのみや かぐや, Shinomiya Kaguya) is the titular character of the series and main female protagonist. She is a second year student at Shuchi'in senior highschool and the vice president of the student council in the academy.<h2>Origin</h2>Kaguya is based off of Nayotake no Kaguya-hime (名夜竹の輝夜姫), the main character of The Tale of the Bamboo Cutter. Her cold personality is based off of Aka Akasaka's interpretation of how Kaguya-hime charged her many suitors with impossible tasks<h2>Appearance</h2>Kaguya is a beautiful young girl with long black hair, white skin, a slim build, red eyes, and always has her hair tied with a ribbon. In the past before, she entered the student council and has always worn her hair down without the iconic red ribbon. It is yet unrevealed if there is an extensive history behind this change in image. She is typically dressed in the Shuchi'in school uniform.<h2>Personality</h2>Kaguya was a very cold and rational individual and only started to warm up to others after joining the student council. After joining the student council, she considered Miyuki Shirogane as one she would be fine to be in a relationship with if, and only if, he confesses first, thus she constantly plays mind games in trying to get Miyuki to confess. Later in the series her actions imply that she is starting to accept her feelings of liking Miyuki, but she still doesn't openly admit it.",
    "sourceUrl": "https://kaguyasama-wa-kokurasetai.fandom.com/wiki/Kaguya_Shinomiya",
    "animeUrl": "https://myanimelist.net/anime/37999/Kaguya-sama_wa_Kokurasetai__Tensai-tachi_no_Renai_Zunousen"
  },
  {
    "name": "Ai Hayasaka",
    "anime": "Kaguya-sama wa Kokurasetai",
    "image": "ai_hayasaka.png",
    "description": "Ai Hayasaka (早坂 愛はやさか あい, Hayasaka Ai) is a supporting character in the series. She is a second year student in Shuchi'in highschool and an employee under the Shinomiya family as Kaguya Shinomiya's personal valet.\n<h2>Origin</h2>Ai is based off of the celestial envoy from The Tale of the Bamboo Cutter who was tasked with returning Kaguya-hime to the moon. This is reflected in the star pattern that can be found on most of her personal belongings.\n<h2>Appearance</h2>Ai is a beautiful young girl with blonde hair that is most usually hair tied up at the left side of her head (She lets her hair down with a small braid tied on the right side when she's disguising as Haysaca A. Smithee) and blue eyes. Her expressions are flexible depending on the need and can express any emotion ranging from a cold stare to a look of pure love. She typically wears the Shuchi'in school uniform — albeit slightly modified to give it a fashionable look.\n<h2>Personality</h2>Ai is a young girl that can adopt multiple personalities to suit the situation, most notably her gal mode and Firis high school mode. Not many people know about her true personality and it is apparently similar to Kaguya Shinomiya's personality. Despite being a part of the Shinomiya house, she is more loyal to Kaguya and acts more in the interest of Kaguya's happiness than to the Shinomiya house itself, going so far as to directly disobey orders from higher ups and disguising herself as Kaguya to let her enjoy the summer fireworks once.\n<h2>History</h2>The Hayasaka family was once prominent, but lost their conflict to the Shinomiya family and, noted for their fine bloodline, were absorbed into it. Ai was born in the Shinomiya family's main house as a thoroughbred servant and was given a special education. She was born into and grew up in an isolated world like Kaguya Shinomiya was, but Ai is less sheltered.",
    "sourceUrl": "https://kaguyasama-wa-kokurasetai.fandom.com/wiki/Ai_Hayasaka",
    "animeUrl": "https://myanimelist.net/anime/37999/Kaguya-sama_wa_Kokurasetai__Tensai-tachi_no_Renai_Zunousen"
  },
  {
    "name": "Megumin",
    "anime": "Kono Subarashii Sekai ni Shukufuku wo!",
    "image": "megumin.png",
    "description": "Megumin (めぐみん) is an Arch Wizard of the Crimson Demon Clan in the Fantasy World, and is the first person to join Kazuma's party. She is one of the main characters of the KonoSuba series.\n<h2>Appearance</h2>Megumin is a young girl with shoulder-length dark brown hair (smooth black in light novel) and crimson-colored eyes. She wears a classical witch attire such as a black cloak with gold border, choker, wizard's hat, fingerless gloves, and carries a black staff. Though she jokingly claims that her eyepatch seals her immense power, she sees it as a stylish sense of fashion due to her chuunibyou tendencies.\n<h2>Personality</h2>Megumin is a straightforward girl, who speaks in an old-style Japanese dialect. She can be very hyper and lively at times and has chuunibyou tendencies like the rest of the Crimson Demon villagers. She is very intelligent, but has very little self-control, especially when it comes to using Explosion magic. She has no problem wasting her spell on empty plains or abandoned castles, as long as she can use Explosion once a day.\n<h2>History</h2>She decided to become an Explosion mage after a busty older woman saved her with Explosion magic when she was young, and after learning it claims she \"must cast Explosion once a day or die.\"\n\nWhile still attending school, Megumin would swindle food from Yunyun every day since her parents couldn't afford meals. Due to her exceptional academic performance, Megumin was able to graduate early. When she left to travel alone, Yunyun predicted she would be \"at a loss due to a lack in the means of survival, begging a useless guy for a meal.\"\n\nAfter traveling to Axel Town, she quickly gained a reputation as a crazy Explosion fanatic, thus parties refused to accept her before meeting Kazuma and Aqua.\n<h2>Abilities</h2>Megumin is absolutely obsessed with Explosion magic. She devotes all of her skill points into improving the power of her explosions, shortening her casting time, and being able to cast the spell without chanting out loud. However, the severe mana drain, combined with Megumin never using points to increase her mana, results in her always collapsing after casting and becoming completely immobile. Also, her refusal to learn any other magic makes her entirely dependent on allies after casting. This is especially notable because there are other known Arch Wizards who can use Explosion magic can remain standing after casting, know at least one other skill, and can fight alone if necessary.",
    "sourceUrl": "https://konosuba.fandom.com/wiki/Megumin",
    "animeUrl": "https://myanimelist.net/anime/30831/Kono_Subarashii_Sekai_ni_Shukufuku_wo"
  },
  {
    "name": "Darkness",
    "anime": "Kono Subarashii Sekai ni Shukufuku wo!",
    "image": "darkness.png",
    "description": "Dustiness Ford Lalatina (ダスティネス・フォード・ララティーナ), usually known as Darkness (ダクネス), is one of three female protagonists of the KonoSuba series. She is a crusader with masochist tendencies who joins Kazuma's party early on.\n<h2>Appearance</h2>A tall, beautiful young woman, Darkness gives the appearance of a cool beauty. She is well-endowed and also has light blue eyes and straight, long blonde hair, usually kept in a ponytail tied with a braid and red hair clips secured on both sides of her bangs. She is usually seen clad in black, white, and yellow armour, with a metal shoulder plate on her left side, and a wing-like cloth perched upon her right shoulder.\n<h2>Personality</h2>As a crusader, Darkness initially presents herself with an aura of pride and nobility, preaching about her duty to shield others from harm. She speaks in a very serious tone of voice and often comes off as very mature.\n\nDespite these outward appearances, however, it does not take long for Darkness to reveal her true character: that of a complete masochist. While she does want to protect others, her masochistic urges are what ultimately drive her to commit many of her “heroic” acts throughout the series, resulting in many onlookers viewing her as a role model for her supposed selflessness. Her masochism extends to verbal abuse as well, a running gag being how she often responds to Kazuma’s sharp insults with her reeling back in pleasure. Throughout the story, she becomes progressively more open about her true intentions, to the point where she blatantly reveals her reason for becoming a crusader was in hopes of being sexually tortured by the Demon King, and that her ideal husband is an abusive alcoholic who would force her to sell her body for money.\n<h2>History</h2>Darkness rarely talked about herself or her background. When she does talk, it is usually about her twisted fantasies. However, we get some subtle hints that she has a high-class background, such as how she conducted herself (when she is not in her masochistic mode) or how her family sent them the very expensive snow crabs as a house-warming gift.\n\nWe later learned that she is a high noble, belonging to the prestigious Dustiness family. While Darkness disapproves of abusing her high position, showing her family badge alone will get immediate obedience from most officials and knights. In LN 8, she started to serve as the acting lord of Axel town in her father's stead, after the previous lord mysteriously disappeared, thought to be in hiding from his criminal and corruption charges.",
    "sourceUrl": "https://konosuba.fandom.com/wiki/Darkness",
    "animeUrl": "https://myanimelist.net/anime/30831/Kono_Subarashii_Sekai_ni_Shukufuku_wo"
  },
  {
    "name": "Aqua",
    "anime": "Kono Subarashii Sekai ni Shukufuku wo!",
    "image": "aqua.gif",
    "description": "Aqua (アクア) is one of the main characters of the KonoSuba series. Prior to life in the Fantasy World, she was a goddess of water who guided humans to the afterlife; within, she is worshipped by the Axis Order.\n<h2>Appearance</h2>Aqua is described as being such a supernaturally beautiful god that Kazuma notes her beauty being \"beyond the idols shown on television\" and \"surpassing humans\".\n\nShe has a slim figure with ample breasts, long legs, blue waist-long hair that is partially tied into a loop with a water-molecule shaped clip. Aqua's clothes carry a blue color scheme, with her ordinary attire consisting of a vest, detached sleeves, thigh-high boots, an extremely short miniskirt, and a transparent underskirt. She also wears a divine relic in the form of a translucent pink hagoromo, which can disappear and reappear around her at her will.\n<h2>Personality</h2>Aqua has an interesting yet troublesome personality. She is high-spirited, cheerful, and carefree, but rarely thinks about the consequences of her actions. While she doesn't force her beliefs onto others, Aqua always acts or speaks on her whims; so, she can behave very inappropriately in many situations. It is also very easy to taunt Aqua with jeers or lure her with praises. Since Aqua, as a goddess, thrives on praise/worship points, she usually performs good deeds, but then immediately ruins her own merits by seeking praises aggressively and persistently. Also, while many of her 'good deeds' turn out fine, Aqua is very short-sighted, and some of these \"good deeds\" actually turn out to be complete disasters.\n<h2>History</h2>Aqua is worshiped by the Axis Order in the Fantasy World. Though hundreds of years had been passing in the Fantasy World since she started sending Japanese people there before being dragged to it herself by Kazuma, because of the difference in which time passes between the fantasy world and heaven she says to Kazuma that she has barely lived a bit longer than him.",
    "sourceUrl": "https://konosuba.fandom.com/wiki/Aqua",
    "animeUrl": "https://myanimelist.net/anime/30831/Kono_Subarashii_Sekai_ni_Shukufuku_wo"
  },
  {
    "name": "Meiko Honma",
    "anime": "Ano Hi Mita Hana no Namae wo Bokutachi wa Mada Shiranai",
    "image": "menma.jpg",
    "description": "Meiko Honma, who is also called by her nickname Menma, is the female protagonist in the story whose ghost shows up to Jinta Yadomi because of her wish that he and his friends must grant. She is a childlike girl who was part of the Super Peace Busters before she died because of an accident.\n<h2>Appearance</h2>As a child, Meiko appears as a small 5-year-old little girl with long, straight, silver hair that reaches past her shoulders with her bangs cut fringed on top of her forehead. Her eyes are light blue and wide, making her look like a cheerful, innocent child.\n<h2>Personality</h2>Menma is a very kind and cheerful girl with a very air-headed nature and she often worries about others before herself, especially when it comes to Jinta \"Jintan\" Yadomi. She is extremely childish (although this may partially be down to the fact she died as a child and has only recently been 'resurrected').\n<h2>History</h2>On some particular day in their hideout, Naruko \"Anaru\" Anjou asked Jinta \"Jintan\" Yadomi if he liked Menma. With this question he felt embarrassed and acted impulsively, calling Menma \"ugly\" and ran out. Instead of crying, Menma smiled and chased the embarrassed Jinta. It was never actually shown what happened to Menma, but the anime indicates that she slipped and fell while chasing Jinta and drowned in a river nearby.",
    "sourceUrl": "https://anohana.fandom.com/wiki/Meiko_%22Menma%22_Honma",
    "animeUrl": "https://myanimelist.net/anime/9989/Ano_Hi_Mita_Hana_no_Namae_wo_Bokutachi_wa_Mada_Shiranai"
  },
  {
    "name": "Kiyoko Shimizu",
    "anime": "Haikyuu!!",
    "image": "kiyoko_shimizu.jpg",
    "description": "Kiyoko Shimizu (Japanese: 清水 潔子しみず きよこ Shimizu Kiyoko) is one of the managers of the Karasuno High volleyball club.\n<h2>Appearance</h2>Kiyoko is a pale-skinned girl with shoulder-length black hair, grey eyes, a distinctive mole on the lower left side of her chin, pink square glasses and a slender build.\n\nShe is commonly described as an attractive girl who garners attention from both male and female students. She has a slender build and has been described as \"somewhat erotic\" multiple times. Because of her appearance, Karasuno High is generally known as the team with the beautiful manager. \n<h2>Personality</h2>Although Kiyoko is a generally quiet girl who doesn't express her thoughts often, she is a serious and passionate girl about her position as a team manager and was reluctant to step down from the club after the Interhigh. She cares a lot about the members, going out of her way to fix and wash Karasuno High's old banner to boost the team's morale and recruiting a manager on her own so the underclassmen won't have to worry about it next year.\n<h2>Background</h2>Kiyoko was previously a member of her middle school's track and field team who specialized in hurdles and as a result, injured her legs often. Because of the team's large size and her inability to talk to others, she wasn't particularly close to any of the juniors. She eventually retired from the sport for unknown reasons.\n\nIn her first year of high school, she was recruited by Daichi to become the manager for Karasuno's Boys' Volleyball Club.",
    "sourceUrl": "https://haikyuu.fandom.com/wiki/Kiyoko_Shimizu",
    "animeUrl": "https://myanimelist.net/anime/20583/Haikyuu"
  },
  {
    "name": "Hestia",
    "anime": "Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka",
    "image": "hestia.png",
    "description": "Hestia (ヘスティア) is a Goddess and head of the Hestia Familia.\n<h2>Appearance</h2>Hestia is a beautiful and petite Goddess with a youthful appearance. She has blue eyes and mid-thigh length black hair tied into two twin tails which reach down to her mid thighs. Her hair is tied with hair accessories that feature blue and white petals along with bell shaped ornaments. She has a small frame (4' 7\"), which further emphasizes her breasts, hence the nickname \"Loli Big-boobs.\" Her usual attire is a white mini dress with a blue ribbon around her neck and one tied under her breasts around her arms, and a pair of white gloves. She is usually barefoot, but occasionally wears a pair of white flip-flops.\n<h2>Personality</h2>Hestia is a kind and energetic Goddess. She also dreams of being in a relationship with Bell and sees Ais and the other girls as her love rivals. Despite this, she does acknowledge the children of the lower world. Hestia is also a hard worker, working two jobs just to pay off her debt for the Hestia Knife. However, she also has somewhat of a lazy side as she stayed with Hephaestus until she was forced out and later took a while to find work.\n<h2>History</h2>After descending to the Lower World, Hestia was taken care of by her friend Hephaestus. Soon after, she was asked to live on her own after she kept freeloading off of Hephaetus's familia and was given a room at an abandoned church.\n\nHestia tried to create her own familia, but wasn't able to recruit anyone. After failing to recruit for the 50th time, she noticed Bell and decided to secretly follow him. Hestia found out that Bell had been trying to enter a familia, but was rejected multiple times and seemed to be in the same boat. Hestia then took the chance to recruit him, which Bell happily agreed upon; becoming the first member of her familia. She took Bell to a bookstore, the location she already decided beforehand, and granted her Falna to her first dependent.",
    "sourceUrl": "https://danmachi.fandom.com/wiki/Hestia",
    "animeUrl": "https://myanimelist.net/anime/28121/Dungeon_ni_Deai_wo_Motomeru_no_wa_Machigatteiru_Darou_ka"
  },
  {
    "name": "Rem",
    "anime": "Re:Zero kara Hajimeru Isekai Seikatsu",
    "image": "rem.png",
    "description": "Rem (レム) is one of the twin maids working for Roswaal L Mathers.\n<h2>Appearance</h2>Rem has medium length sky blue hair that covers her right eye, large light blue eyes, and young features. She also has hair clips towards left side of her hair, flower-shaped ribbon on the same side of her hair, and a maid hairband. She looks nearly identical to her sister apart from her hair, eyes, and ribbon coloring. She usually wears a maid uniform, and since her chest is slightly larger than her sister's, she secretly changes the measurements to hide it.\n<h2>Personality</h2>Rem tends to speak in a superficially polite manner and sometimes acts without thinking. She holds both respect to the point of worship and guilt toward her sister for an incident in the past. Because of her respect and guilt toward her sister, she used to think of herself as inferior. After Subaru saves her, she falls deeply in love with him, becoming one of his most loyal followers. Rem will stick with him no matter what happens, even if Subaru rejects himself.\n\nCurrently Rem has had her name and memories eaten by Ley Batenkaitos, erasing her existence from the world and putting her in suspended animation.\n<h2>History</h2>Rem lived along with her father, mother, and her elder sister Ram in an Oni village. Initially, because they were born with one horn each it meant they were defective in the view of the Oni community whom believe individual strength above all else and were despised for it. They were to be killed as the custom of Oni to protect their pride as strongest of the demi-humans, until just before the execution Ram displayed the potential of her power to protect them both at which shocked the community. Being allowed to live thanks to her older sister who had an aptitude that had not been seen in a millennia among Oni kind, Rem spent rest of her days in her shadow. Despite presence of her sister also raising expectation for herself in the community, she could never meet them nor surpass her sister in any area which earned her disappoint from the other villagers. However Rem loved her sister and accepted her place behind and very least her parents still cared for them both deeply even if she herself found difficult to believe in front of the brilliance of her older sister. One night Rem's life change forever when it got attacked by the Witch Cult around 6 years before the beginning of the story, following into her sister's horn being cut off by Faust. The whole village got destroyed along with her parents and the citizens, except for her and Ram.",
    "sourceUrl": "https://rezero.fandom.com/wiki/Rem",
    "animeUrl": "https://myanimelist.net/anime/31240/Re_Zero_kara_Hajimeru_Isekai_Seikatsu"
  },
  {
    "name": "Emilia",
    "anime": "Re:Zero kara Hajimeru Isekai Seikatsu",
    "image": "emilia.png",
    "description": "Emilia (エミリア) is the main heroine of the Re:Zero kara Hajimeru Isekai Seikatsu series. She is a Half Elf and a candidate to become the 42nd King of Lugnica. After Arc 4, Subaru officially becomes her knight.\n<h2>Appearance</h2>Emilia is a beautiful Half Elf with long silver hair and purple blue eyes. She wears a white and purple outfit along with a white flower in her hair. Throughout the series, she has styled her hair in a variety of ways.\n\nWhen Emilia still lived in Elior Forest and was younger, she had a different set of clothes, with the same color pattern. She had a light green ribbon instead of her necklace, a different flower in her hair, and a hairband in her hair.\n<h2>Personality</h2>Emilia is good natured and likes to take care of others, though she herself refuses to admit it, instead thinking of it as her own selfishness. As a result, this often has Emilia avoid opening up to others and sharing her burdens to a very stubborn degree. She is indifferent to her own appearance, leaving Puck to take care of her clothes and hair. Because her appearance is similar to the Witch of Envy, she has received harsh discrimination from others.\n\nShe has a tendency to use a lot of antiquated words that you would only hear out of an old person. On rare occasions, Emilia will let out her childish side when faced with something very unfamiliar to her because up until a few years ago she was unacquainted with the social norms of the outside world beyond the woods she used to live in alongside other elves. Despite this, she adapts quickly and still works hard to become a king.\n<h2>History</h2>About a century ago, Emilia lived with her aunt on her father's side in Elior Forest. Back then for reasons not known to her she was considered a rather special child spent most of her days isolated from the other eleven villagers in a place called the \"Princess Room\" with only Fortuna, her doll and spirits for company. While she normally obeyed her aunt and loved her, deep down a part of Emilia resented her and the village for stripping her of freedom, constantly hiding things from her.",
    "sourceUrl": "https://rezero.fandom.com/wiki/Emilia",
    "animeUrl": "https://myanimelist.net/anime/31240/Re_Zero_kara_Hajimeru_Isekai_Seikatsu"
  },
  {
    "name": "Kosaki Onodera",
    "anime": "Nisekoi",
    "image": "onodera.png",
    "description": "Kosaki Miyanagi née Onodera (小野寺 小咲, Onodera Kosaki) is one of the main characters of the Nisekoi series. She is one of the love interest of Raku Ichijō.\n<h2>Background</h2>Kosaki comes from a family of pastry chefs; all of whom specialize in making and decorating candies. However, her father is missing for the most part of the series and is hinted to have his own work to deal with. Thus, Kosaki has since been living with her eccentric mother and her feisty younger sister in their Japanese candy shop. Ironically, despite this environment, she grows up to be very timid by nature.\n<h2>Personality</h2>Kosaki is discreet, innocent, and slightly timid. She is very kind, taking care of Raku Ichijō when he is wounded or ill. Generally, she opts to think carefully before acting, as seen when she stalls her confession to Raku in consideration that he may have feelings for Chitoge Kirisaki.\n\nAt times, Kosaki shows signs of lacking self-confidence and often needs the support of Ruri Miyamoto (Kosaki's best friend). This is also proven by the fact that Kosaki's younger sister is very over-protective of her (even though Kosaki is older than Haru). In confrontations with Raku, Kosaki initially needs encouragement from Ruri to attempt any form of contact as she lacks self-confidence around him. \n<h2>Appearance</h2>Kosaki is a fair-skinned teenage girl with dark brown and shoulder-length with one long strand of hair which she keeps combed neatly to the left side of her face and chocolate brown eyes. Kosaki is average in height and has a thin figure. She looks a lot like her mother. She has the school uniform as most of her classmates do which is a half-sleeved or long-sleeved (depending on the season) white shirt with a blue sailor-style collar attached at the lower part of her neck that connects a thin orange tie that is laced through a loop at the end of the shirt, making a little part of the tie to reach the skirt. The skirt reaches around the upper thighs and is a blue-colored fabric that is accompanied by her white knee-length socks and brown slip-on shoes.",
    "sourceUrl": "https://nisekoi.fandom.com/wiki/Kosaki_Onodera",
    "animeUrl": "https://myanimelist.net/anime/18897/Nisekoi"
  },
  {
    "name": "Chitoge Kirisaki",
    "anime": "Nisekoi",
    "image": "chitoge.png",
    "description": "Chitoge Ichijō (一条 千棘, Ichijō Chitoge; (née Kirisaki (桐崎)) is the main female protagonist of the Nisekoi series. She is the daughter of Adelt Wogner Kirisaki and Hana Kirisaki She served as the fake girlfriend of Raku Ichijō for the next three years of her school life to prevent a war from starting between their families.\n<h2>Appearance</h2>Chitoge is an attractive young woman with stunning features, slim build, and fair skin with a pale complexion. She has beautiful waist-length blond hair with pink tips at the end of her hair and strikingly aqua-blue eyes. Coupled with her height - tall by most standards - and her natural figure, many people associate her with a supermodel. Her most notable feature is the red ribbon that she always uses to tie her hair which was given by her mother. This is from when she was quite young, but she still prefers to wear this specific one though her mother has offered to buy her many more. In the manga, it was noted that her ribbon looked like the one the girl on Kosaki Onodera's picture book had.\n<h2>Personality</h2>Chitoge is somewhat a forgetful, stern and bold girl. However, once someone gets to know her better, she becomes very talkative and nice. Similar to Raku Ichijō, Chitoge is the type to go out of her way to help someone. For example, when Raku lost his pendant once again from the chain being broken, Chitoge had secretly gotten the Beehive gang to help fix it for him and gave it back later that night.\n\nChitoge is somewhat oblivious when it comes to love and others' love interests, for example, how she didn't know what Seishirō Tsugumi’s \"symptoms\" were, which were actually love. She is also very athletic as she can easily jump over the school's walls and swim the length of the school pool in a couple of seconds\n<h2>Background</h2>Chitoge originally lived with Adelt Wogner Kirisaki (Chitoge's father) in the United States until she transferred to another school in Japan, where she is now currently attending. With her father being the leader of the infamous Bee Hive Gang, it has caused multiple problems for Chitoge during her childhood as she was unable to make friends as they disliked her. Being under constant watch by Claude Ringheart (Chitoge's bodyguard), the students from her childhood also disliked her. However, when she was young, she met and befriended a hitwoman in-training named Seishirō Tsugumi, who, to the current day, she is still friends with. Chitoge also seems to have a few problems with her mother, who has very high expectations for her, making Chitoge somewhat of a perfectionist who excels in both sports and academics.",
    "sourceUrl": "https://nisekoi.fandom.com/wiki/Chitoge_Kirisaki",
    "animeUrl": "https://myanimelist.net/anime/18897/Nisekoi"
  },
  {
    "name": "Yuuki Asuna",
    "anime": "Sword Art Online",
    "image": "yuuki_asuna.png",
    "description": "Yuuki Asuna (結城 明日奈, Yūki Asuna), known as Asuna (アスナ, Asuna) in «Sword Art Online» (SAO), «ALfheim Online» (ALO), as well as «Project Alicization», where she had temporarily used the Stacia (ステイシア, Suteishia) account, is the main heroine of the Sword Art Online series, the deuteragonist of the Aincrad Arc, as well as the protagonist of the Mother's Rosario side story. She is the daughter of the former CEO of RECT Inc.. Asuna was one of the 10,000 players trapped in «Sword Art Online», where she was the sub-leader of the «Knights of the Blood» (KoB) guild. Her skills with the rapier had her earned her the nickname «The Flash» (閃光, Senkō).\n<h2>Appearance</h2>Asuna has long, orange-brownish chestnut hair and hazel eyes. In the early levels of SAO, she wore a dark red leather tunic with a lightweight copper breastplate and leather pants with boots up to the knees along with a hooded cape. After joining the «Knights of the Blood», she wore a red and white uniform that all KoB members wear and wielded a rapier made by Lisbeth, called the «Lambent Light». Asuna's avatar as Creation Goddess Stacia maintains her chestnut hair and light brown eyes. She wears armor with a pearly shine and a long skirt consisting of countless fine fabrics.\n<h2>Personality</h2>Asuna originally did not care about dying in the game before meeting Kirito. That meeting drastically changed Asuna's personality and outlook on life. She soon takes most things Kirito says to heart and looks to him for help, using him as somewhat of a lifeline.\n\nAsuna is a kind and helpful young woman who, similarly to Kirito, cannot abandon another in trouble. She takes the game very seriously and is determined to clear it before Kirito tells her to enjoy SAO a bit. Asuna is also somewhat proud and despite her kind personality, she will not hesitate to get physical with those that challenge her authority or make fun of her abilities, such as cooking. She even challenged Kirito to a duel after an argument over how to handle a Field Boss. She is not afraid to act out on her own and will take matters into her own hands from time to time.\n<h2>Background</h2>Asuna lived a comfortable life in her large home in Setagaya with her mother, father, and her brother. She originally went to private, all-girl schools before the events of SAO.\n\nOn November 6, 2022, Asuna logged onto SAO after she borrowed her brother's NerveGear. He had acquired a copy of the game and a NerveGear through his connections but could not play the game on the opening day due to a sudden business trip. When she discovered that she and all of the players were trapped in SAO, she secluded herself inside of her rented room in the «Town of Beginnings» for two weeks before resolving to take her fate into her own hands. This led her to kill monsters at an incredible rate and level up in a quick fashion, even risking her life in the process.",
    "sourceUrl": "https://swordartonline.fandom.com/wiki/Yuuki_Asuna",
    "animeUrl": "https://myanimelist.net/anime/11757/Sword_Art_Online"
  },
  {
    "name": "Kurisu Makise",
    "anime": "Steins;Gate",
    "image": "makise_kurisu.jpg",
    "description": "Kurisu Makise (牧瀬 紅莉栖 Makise Kurisu) is the daughter of Shouichi Makise, a genius girl who graduated from university at the age of seventeen, and a member of the neuroscience laboratory of Viktor Chondria University and the Future Gadget Lab.\n\nKurisu is one of the main characters of Steins;Gate, a major posthumous character in Steins;Gate 0 via Amadeus. She is briefly mentioned in Chaos;Child, and she communicates via the in-universe Twitter (Twipo) in Robotics;Notes and Robotics;Notes DaSH.\n<h2>Appearance</h2>Kurisu is a slender young woman with waist-length, reddish hair, and dull violet eyes. Her hair, which she prefers to let loose, ranges in ginger shades all the way from mahogany to auburn. Her hair color differs considerably in the anime (red) from the original VN (chestnut). The \"Kuri\" part of her name means chestnut, and her hair color is most likely meant to resemble the color of a chestnut.\n<h2>Personality</h2>Kurisu is generally a sensible, serious mature young woman, usually calm and collected even when someone is acting tense in front of her. However, she can also show a much more timid side at times. She is shown frequently to hate being nicknamed, as she dislikes all of the names that Okabe gives her, with 'The Zombie' bugging her most of all. Ironically, on the rare occasions Okabe uses her real name, she takes it as a sign that something is seriously wrong. Kurisu is also practical and a realist, almost to a fault; initially, she believes firmly that time machines are fiction and refuses to believe the Phonewave is one even after seeing it in action, claiming that Okabe had simply seen what he wanted to see. It takes the group's looking up SERN's research about time travel to finally convince Kurisu of the truth. However, in Steins;Gate 0, she doesn't deny the possibility of time machines and will build one herself if she had the materials.",
    "sourceUrl": "https://steins-gate.fandom.com/wiki/Kurisu_Makise",
    "animeUrl": "https://myanimelist.net/anime/9253/Steins_Gate"
  },
  {
    "name": "Mayuri Shiina",
    "anime": "Steins;Gate",
    "image": "mayuri_shiina.png",
    "description": "Mayuri Shiina (椎名 まゆり, Shīna Mayuri), also known as Mayushii☆, is Rintaro Okabe's childhood friend, a part-time worker at May Queen Nyan-nyan and a member of the Future Gadget Lab. She is also an avid cosplay maker and friend of Luka Urushibara and Akiha Rumiho.\n\nDuring the year 2036 in the Beta Attractor Field, Mayuri becomes Kagari Shiina's adoptive mother.\n<h2>Appearance</h2>Mayuri is a short girl with short black hair and lightly blue iris. Her hair forms fringes that sweep from either side. Mayuri's eyebrows are noticeably thick.\n\nMayuri's outfit is simple and comfortable, consisting of a light blue one-piece dress and a hat of the same color. She also wears leggings underneath her clothing.\n\nWhen she attends to her work at May Queen Nyan-nyan, she wears a blonde wig tied into a long ponytail.\n<h2>Personality</h2>Mayuri possesses an extremely childish and naïve attitude for her age. While this may have something to do with her inability to accept the death of her grandmother when she was young, Okabe states at one point that she's always been a little bit different, though he never goes into any detail beyond this. Mayuri has a great fondness for cute things like Upa cushions, and likes to give cute nicknames to familiar people, like Okarin for Okabe, being a portmanteau of his last and first names Okabe Rintaro, even referring to herself as Mayushii, being a portmanteau of Mayuri Shiina.",
    "sourceUrl": "https://steins-gate.fandom.com/wiki/Mayuri_Shiina",
    "animeUrl": "https://myanimelist.net/anime/9253/Steins_Gate"
  },
  {
    "name": "Raphtalia",
    "anime": "Tate no Yuusha no Nariagari",
    "image": "raphtalia.gif",
    "description": "Raphtalia (ラフタリア Rafutaria) (also ambiguously translated as Raftalia) is a Tanuki-type Demi-Human who was the first real member of the Shield Hero's party after he purchased her as a slave. She is now the Katana Hero (刀の勇者 Katana no Yuusha).\n<h2>Appearance</h2>She has undergone some significant changes throughout the story. When Raphtalia is first introduced, she is a child that has long, unmanaged hair and a dirty cloth gown. After being purchased by Naofumi, he gave her a haircut to an acceptable length, gave her a bath, and bought her a much more suitable set of clothes to adventure in. As a Tanuki demi-human, Raphtalia is shown to have fluffy dog-like ears and an averagely sized bushy tail.\n<h2>Personality</h2>Raphtalia was initially very shy, sickly, and fearful as a result of her status as a slave, as well as suffering from trauma with memories of the destruction of her village. After the encounter with the two-headed dog monster, she overcomes the trauma from her parents' death at the hands of the Cerberus and acknowledges Naofumi as a hero in her own mind.\n<h2>Background</h2>Until the age of 10, Raphtalia lived in a small coastal village outside of Melromarc, where everyone lived in harmony until the first wave of calamity attacked. During the attack, Raphtalia and her parents fled their home but considering they could only dive into the sea to escape the monsters Raphtalia's parents made the ultimate sacrifice. Her parents pushed her off a nearby cliff as the wave approached them, and she watched as her parents were engulfed by the Cerberus. Raphtalia survived the fall and went back to find her parents, but was unsuccessful. Shortly thereafter a group of Melromarc Knights came to her village and killed all the adult survivors. They captured all the young ones and sold them to the slave hunters for money.",
    "sourceUrl": "https://shield-hero.fandom.com/wiki/Raphtalia",
    "animeUrl": "https://myanimelist.net/anime/35790/Tate_no_Yuusha_no_Nariagari"
  },
  {
    "name": "Nezuko Kamado",
    "anime": "Kimetsu no Yaiba",
    "image": "nezuko.png",
    "description": "Nezuko Kamado (竈門かまど禰ね豆ず子こ Kamado Nezuko) is the younger sister of Tanjiro Kamado and one of the two remaining members of the Kamado family. Formerly human, she was attacked and turned into a Demon by Muzan Kibutsuji. She is one of the main protagonists of Demon Slayer: Kimetsu no Yaiba.\n<h2>Appearance</h2>Nezuko is a petite young girl with fair skin, visibly large, prominent fangs, and sharp, claw-like nails that fade to red where they point. Her hair is long, dark brown and reaches just below her waist, turning an vermilion color as it passes her elbows, and appears to be crimped into large, straight ridges, worn side-swept drastically to her left. She has soft-looking, pale pink eyes that appear a lighter color around the rims of their irises, slanted downwards towards the sides of her face and framed by notably long eyelashes, the pupils of which can appear slit as she transforms. According to Tanjiro Kamado, Nezuko was known as a great beauty in their home town.\n<h2>Personality</h2>Nezuko's original personality as a human was that of a kind and caring girl, who thought of others before herself much like her older brother, Tanjiro, and was a responsible elder sister to her younger siblings.\n\nAs a Demon, however, Nezuko seems to have forgotten a good portion of her memories as a human, besides those related to her family, and thus doesn't retain the exact personality she had before transformation. She is still very caring and protective towards humans who she sees as members of her family, although this is mainly due to the influence Sakonji Urokodaki had on her while she was asleep for two years. Nezuko also retains some of her human emotions, as she has been seen to cry when sad and smile when happy, but in general she appears more detached than her human cohorts, although she is still much calmer and less malicious than most Demons.\n<h2>History</h2>Nezuko grew up on a mountain alongside her older brother, Tanjiro, and the rest of her siblings and mother, as the eldest daughter of the Kamado family. She presumably took care of her younger siblings as an assistant to her mother, as is briefly witnessed prior to her family's death. Unlike Tanjiro, who was responsible for selling firewood in town, Nezuko would usually help out around the family home.",
    "sourceUrl": "https://kimetsu-no-yaiba.fandom.com/wiki/Nezuko_Kamado",
    "animeUrl": "https://myanimelist.net/anime/38000/Kimetsu_no_Yaiba"
  },
  {
    "name": "Shinobu Kocho",
    "anime": "Kimetsu no Yaiba",
    "image": "shinobu_kocho.png",
    "description": "Shinobu Kocho (胡こ蝶ちょうしのぶ Kochō Shinobu) is a Demon Slayer and the Insect Hashira of the Demon Slayer Corps.\n<h2>Appearance</h2>Shinobu is a petite girl with pale skin and large, compound-looking eyes that do not possess pupils, only a haze of gradient purple, which make her eyes appear similar to those of bugs. She has shoulder-length hair that fades from black into dark purple, usually styled at the back of her head into a \"yakai-maki\" style and fastened with a white and purple butterfly ornament. She has split ear-length bangs that rise a little away from her head before falling down to frame her face, with two thinner chin-length strands below them. Shinobu is rather short in height and has been described as having a small and weak-looking build, which is later reinforced by her saying that she does not possess enough physical strength to cut a Demon's head off as the other Hashira do. According to Zenitsu Agatsuma, Shinobu is so cute, that she could easily make a living on her looks alone.\nShinobu wears the standard Demon Slayer uniform with gold buttons, consisting of a dark-purple tinted straight-lined black jacket and hakama pants that are tucked into a butterfly pattern fabric around her lower legs. She also wears a white haori that previously belonged to her older sister, which has a butterfly wing pattern that fades into a turquoise then pink color on the sleeves and bottom edges which are cuffed with a black and white dotted trim. She wears white sandals with purple straps for footwear.\n<h2>Personality</h2>Shinobu is rather laid-back, always having a smile on her face regardless of the situation she is in. She seems to enjoy teasing others and can be rather sadistic about it, enjoying most notably to pick on Giyu Tomioka. Despite her relaxed exterior and her initial claim of wanting to get along with Demons, she can be rather cruel towards them, which is seen when she kills the Older Sister Spider Demon after giving her false hope of helping her and also attempting to kill Nezuko Kamado without hesitation. Later on, she is shown to have a more compassionate side towards both Tanjiro Kamado and his sister after hearing their full story.",
    "sourceUrl": "https://kimetsu-no-yaiba.fandom.com/wiki/Shinobu_Kocho",
    "animeUrl": "https://myanimelist.net/anime/38000/Kimetsu_no_Yaiba"
  },
  {
    "name": "Mitsuri Kanroji",
    "anime": "Kimetsu no Yaiba",
    "image": "mitsuri_kanroji.png",
    "description": "Mitsuri Kanroji (甘かん露ろ寺じ蜜みつ璃り Kanroji Mitsuri) is a Demon Slayer and the Love Hashira of the Demon Slayer Corps.\n<h2>Appearance</h2>Mitsuri is a curvaceous young woman with fair skin and round, light green eyes with notably long eyelashes, a small mole beneath each of them. She has long, pale pink hair that fades into a neon green color at the halfway point, which she wears in three thick braids with five shorter clumps hanging over her face as bangs. When she was trying to get married, her hair was dyed black in an attempt to make herself look more \"normal.\"\nMitsuri wears a modified version of the standard Demon Slayer uniform; the breast area is left unbuttoned to accommodate her chest size and she wears a short skirt in place of the usual hakama, and a plain white haori. As well as this, she wears a pair of navy blue thigh-high socks, over which she also sports the striped lime green socks Obanai Iguro gave to her, and pink laced footwear.\n<h2>Personality</h2>Mitsuri is a very emotional and passionate person, who is constantly complimenting people in her head, which likely relates to why she is called the 'The Hashira of Love.' She is rather shy, and is always soft and kind to others, most notably to Obanai, whom she appears to share an especially strong bond with, but is easily flustered and can't take insults very well. However, despite her gentle demeanor, Mitsuri will show no mercy in the face of Demons, instead expressing such sentiments with a passionate tone. She used to feel very guilty for joining the Corps for such a shallow reason as finding a husband, though she has since gotten over those feelings.\nShe is desperate for marriage, however, since she wants to find a man who's stronger than her, which is rather difficult due to her ludicrous strength.",
    "sourceUrl": "https://kimetsu-no-yaiba.fandom.com/wiki/Mitsuri_Kanroji",
    "animeUrl": "https://myanimelist.net/anime/38000/Kimetsu_no_Yaiba"
  },
  {
    "name": "Kanae Kocho",
    "anime": "Kimetsu no Yaiba",
    "image": "kanae_kocho.png",
    "description": "Kanae Kocho (胡こ蝶ちょう カナエ Kochō Kanae) was a Demon Slayer and the late Flower Hashira, slain several years prior to the present story. She was also the biological older sister of Shinobu Kocho and the adoptive older sister of Kanao Tsuyuri.\n<h2>Appearance</h2>Kanae was a girl of a slender build, much like her younger sister, who was rather tall for her age and had notably red lips in contrast to her pale complexion. She had long, straight hair of a very dark gray color that reached just below her waist, worn down with two shorter clumps over her shoulders, and arched, ear-length bangs on either side of her face. Her eyes were a pale violet and slanted towards the sides of her face, bright and bug-like, with many notable white sparkles reflecting light off of them.\nKanae wore a purple-tinted version of the standard Demon Slayer uniform, as well as a piece of black fabric around her calves and sandals with pale straps. She also sported a pair of green and pink butterfly hairpins that she wore adorned on either side of her head - one of which was later used by her adoptive younger sister, Kanao Tsuyuri, as a memento. She also wore the white, light green and pink butterfly-patterned haori that Shinobu Kocho now wears in the present.\n<h2>Personality</h2>Kanae is shown to be a kind girl with an easygoing personality; in Shinobu and Kanao's flashbacks, she is almost always seen with a gentle smile on her face. When Sanemi Shinazugawa lashed out against their leader, Kagaya Ubuyashiki, she displayed concern for Kagaya and gently informed Sanemi how Kagaya truly cares for the Demon Slayers under his charge. Kanae also had a dream of someday being able to live peacefully alongside Demons despite all the suffering and death they have inflicted on humans, which inspired Shinobu to aspire to do the same.\nHowever, Kanae had a much stricter side, as shown when Shinobu was on the verge of defeat during her battle with Doma. Kanae's spirit ordered her to stand up and face her opponent, brushing away the excuses forming in her mind that she was too delicate to take on Demons. Kanae was also keenly observant, seeing through Doma's acting and lies, and deducing that he was in fact emotionless and empty. According to Kanao, Kanae felt sorry for him due to his emptiness, even though he mortally wounded her.",
    "sourceUrl": "https://kimetsu-no-yaiba.fandom.com/wiki/Kanae_Kocho",
    "animeUrl": "https://myanimelist.net/anime/38000/Kimetsu_no_Yaiba"
  },
  {
    "name": "Kanao Tsuyuri",
    "anime": "Kimetsu no Yaiba",
    "image": "kanao_tsuyuri.png",
    "description": "Kanao Tsuyuri (栗つ花ゆ落りカナヲ Tsuyuri Kanao) is a Demon Slayer, the adopted sister of Kanae Kocho and Shinobu Kocho and Shinobu's former Tsuguko.\n<h2>Appearance</h2>Kanao is a young girl with large, gentle eyes of a pink-lilac color that are framed by thick eyelashes. She has thin black hair, worn tied into a ponytail on the right side of her head and fastened by a pink and green butterfly ornament that once belonged to her adoptive sister, Kanae Kocho. She has a straight fringe and two loose, chin-length strands that curve downwards from above each of her ears.\nKanao wears a slightly purple-tinted version of the standard Demon Slayer uniform, just with a knee-length pleated skirt in place of the usual hakama pants. Over this, she wears a short white cloak, fastened on one side by a dark pink triple knot, also sporting knee-high lace-up white boots with tan soles, heels and toes.\nWhen Kanao reappears after the events of the Entertainment District Arc, her appearance changes as she stops wearing her white cloak, opting to wear only her plain Demon Slayer uniform instead.\n<h2>Personality</h2>When Kanao is first introduced, she is an indecisive and quiet girl due to the abuse she endured before meeting the Kocho sisters. She became unable to make decisions by herself and repressed her emotions as a defense mechanism. In order to help rectify this, Kanae gave her a coin to flip to decide which path to follow when she didn't know what to do.\nFor many years, Kanao continued to show little emotion or desire. Despite this, after seeing what demons did to Aoi, Kiyo, and Shinobu's loved ones, Kanao developed a strong hatred against demons directly from her own will.\nInitially, Shinobu instructed Kanao to simply cut off demon heads without thinking, since Kanao had no will of her own. However, Kanao also eventually developed her own desire to fight.\nDespite her perceived lack of emotion or desire, Kanao defied Shinobu and Kanae's wishes and took the final selection of her own volition, which would imply that her will had been strengthening all along.",
    "sourceUrl": "https://kimetsu-no-yaiba.fandom.com/wiki/Kanao_Tsuyuri",
    "animeUrl": "https://myanimelist.net/anime/38000/Kimetsu_no_Yaiba"
  },
  {
    "name": "Toru Hagakure",
    "anime": "My Hero Academia",
    "image": "toru_hagakure.png",
    "description": "Toru Hagakure (葉は隠がくれ透とおる Hagakure Tōru), also known as the Stealth Hero: Invisible Girl, is a student in Class 1-A at U.A. High School, training to become a Pro Hero.\n<h2>Appearance</h2>Toru is a fairly short girl with a completely invisible body. She is only identifiable through held or worn objects, like pieces of clothing and accessories, and when clothed, her body appears to be slender yet fairly curvaceous. She claims to look like a fusion of Yang Guifei and Francis Xavier.\nDue to the nature of her Quirk, her hero costume consists only of a pair of baby blue gloves, decorated by pale pink lines, and light brownish-gray lace-up shoes.\nHer winter costume includes plain knee-high boots and slightly thicker-looking gloves with a different color scheme and design.\n<h2>Personality</h2>Toru is a bubbly, cheery, and easygoing girl that does most things with an upbeat attitude, even if manipulated to do so. She is very socially eager and appears to like shopping. Her room suggests that she likes plushies and other cute things.She believes that taking off her clothes during battle is a tactical advantage, much to the awkwardness of those around her. That being said, she seems blissfully unaware of what it means to be invisible, such as displaying slight embarrassment at the idea of being watched undressing; a trait that shows up even when she's wearing her hero costume, which features almost no clothing in the first place.\n<h2>Quirk</h2>Invisibility (透とう明めい Tōmei): Toru's Quirk is that her body is completely invisible. It is unknown if it is permanently active or can be activated and deactivated at will, but she has been shown to stay invisible while unconscious or asleep.",
    "sourceUrl": "https://bokunoheroacademia.fandom.com/wiki/Toru_Hagakure",
    "animeUrl": "https://myanimelist.net/anime/31964/Boku_no_Hero_Academia"
  },
  {
    "name": "Ochaco Uraraka",
    "anime": "My Hero Academia",
    "image": "ochaco_uraraka.png",
    "description": "Ochaco Uraraka (麗うらら日かお茶ちゃ子こ Uraraka Ochako), also known as Uravity (ウラビティ Urabiti), is a student in Class 1-A at U.A. High School, training to become a Pro Hero. She is one of the main protagonists of My Hero Academia.\n<h2>Appearance</h2>Ochaco is a short girl of slender yet feminine build. She is fair-skinned with a perpetual blush on her cheeks. Her eyes are large and round, their irises a warm brown, with rather thick upper eyelashes, two longer and more prominent ones protruding outwards on either side and fewer but more individually pronounced lower eyelashes. Shoulder-length and about the same color as her eyes, her hair is bobbed and curved inwards at the ends, two longer clumps taking the same shape on either side of her face, and short bangs that reach roughly a quarter of the way down her forehead. On the top inner segment of each of her fingers, she has a small pink pad, somewhat resembling the toe of a cat or a dog’s paw, which she uses when activating and deactivating her Quirk.During school, she wears the regular U.A. uniform, just with black tights instead of the usual knee-high socks worn by her other female classmates.\n<h2>Personality</h2>Other students have described Ochaco as \"the most laid back girl\" among her class, being very bubbly and kind of an airhead at times. She is often incredibly blunt without being aware of it. Similar to Izuku Midoriya, Ochaco's reactions tend to be exaggerated and humorous: She often becomes amused at certain personality traits and quirks others exhibit, bursting into laughter at times, which she tries to suppress.\nOchaco is a very warm, lively individual who thinks about everything positively, though she is objective enough to see flaws and virtues. She is empathetic in general, friendly to those she meets, and will try to help or defend anyone who is kind to her or who needs assistance. Ochaco seems to be very good at reading people, understanding the reasons for Izuku Midoriya and Katsuki Bakugo’s rivalry and being the first to notice when the usually collected Tsuyu Asui was upset. Her empathy and kindness are also seen in how well she gets along with her classmates. She is on good terms with everyone and is particularly close friends with several members of the class, including Izuku, Tenya Iida, Tsuyu, and so on.\n<h2>Quirk</h2>Zero Gravity (無重力ゼログラビティ Zero Gurabiti): Ochaco's Quirk gives her the power to nullify the effects of gravity on solid targets (living and nonliving) by touching them with the pads on her fingertips, causing them to become weightless and float. She is able to cancel the effect of her Quirk by touching her finger pads together.\nHer Quirk is good for restraint, as those affected are unlikely to fight back since they will keep floating upwards until they are released. Ochaco takes advantage of ravaged areas to gather wreckage while also exploiting the consequences of a destructive Quirk. She can easily clean up disaster zones while simultaneously figuring out the timing of her movements so as not to damage others.",
    "sourceUrl": "https://bokunoheroacademia.fandom.com/wiki/Ochaco_Uraraka",
    "animeUrl": "https://myanimelist.net/anime/31964/Boku_no_Hero_Academia"
  },
  {
    "name": "Kyoka Jiro",
    "anime": "My Hero Academia",
    "image": "kyoka_jiro.png",
    "description": "Kyoka Jiro (耳じ郎ろう響きょう香か Jirō Kyōka), also known as the Hearing Hero: Earphone Jack (ヒアヒーローイヤホン＝ジャック Hia Hīrō Iyahon Jakku), is a student in Class 1-A at U.A. High School, training to become a Pro Hero.\n<h2>Appearance</h2>Kyoka is a petite, fair-skinned girl with a slender build. She has triangular, lazy-looking onyx eyes with notably long lower eyelashes and rather small eyebrows. Her hair is short, only around chin length, and is dark purple in color with an asymmetrical fringe, and two reflections shaped like sound waves on either side of her head. Her most prominent features are the flexible, plug-like earphone jacks hanging from each of her earlobes at the end of two thin cords, which act like extra limbs; she seems to be able to control these at will, and they are very flexible, able to change length if so desired.\nUnlike the other students, Kyoka sometimes wears a waistcoat over her school uniform, in place of the usual U.A. blazer.\n<h2>Personality</h2>Kyoka has a pragmatic, unenthusiastic and teasing personality that is mostly shown to those she finds irritating, like her fellow classmate Denki Kaminari, whose cluelessness makes him an easy target for her snarky comments. Kyoka is not always like this though, as she does enjoy socializing with others, in which case she is usually nice and friendly.\n<h2>Quirk</h2>Earphone Jack (イヤホンジャック Iyahon Jakku): Kyoka's Quirk is that she has a pair of headphone jacks hanging from her earlobes. When the jacks are plugged into something, Kyoka can channel the sound of her heartbeat into it in the form of a violent vibration attack. She can stretch her earlobes several meters. This Quirk also allows her to hear minuscule sounds and vibrations from her surroundings.",
    "sourceUrl": "https://bokunoheroacademia.fandom.com/wiki/Kyoka_Jiro",
    "animeUrl": "https://myanimelist.net/anime/31964/Boku_no_Hero_Academia"
  },
  {
    "name": "Nejire Hado",
    "anime": "My Hero Academia",
    "image": "nejire_hado.png",
    "description": "Nejire Hado (波動ねじれ Hadō Nejire), also known by her hero name, Nejire Chan (ネジレチャン Nejirechan), is a student in Class 3-A at U.A. High School and is part of The Big 3.\n<h2>Appearance</h2>Nejire is a fair-skinned girl of average height with wide, curious eyes. Her upper eyelashes long and thick, and her irises are a royal blue where her pupils are white. Her hair is periwinkle, and it reaches all the way down to her knees, twisting around itself at her waist and curving inwards around her legs. She has side-swept bangs, tucked behind her ears on the right and hanging just over her eyes on the left, and two short clumps of hair on either side of her face, curved towards her face on the right and behind it, under her ear, on the left. According to the boys at U.A., she’s more of the \"cute kind\" than the \"sexy kind.\"\nNejire wears a waistcoat in place of the normal U.A. blazer with her school uniform like Kyoka Jiro occasionally does.\n<h2>Personality</h2>Nejire is naturally a very kind, talkative, and endlessly curious girl. She shows great interest in people's unique physical features and is easily distracted by them. Due to this, Nejire can be very blunt, often asking rather invasive or off-putting questions.\nNejire is an affectionate person and a \"free spirit,\" someone who has a genuine passion for learning new and strange things and isn't afraid to speak her mind or show how she feels. She seems to like knowing more than others, but not in a proud way, as she just enjoys explaining things to people and sharing her knowledge. She is mentioned to act like a kindergartner due to her childish glee.\n<h2>Quirk</h2>Wave Motion (波は動どう Hadō): Nejire's Quirk grants her the ability to convert her own vitality into energy and release it in the form of exceptionally powerful spiral shockwaves. Since the energy travels in a spiral, it's not very fast. Overusing this Quirk will cause Nejire to suffer from great exhaustion, due to it using her own stamina as a power source.\nNejire can release the shockwaves from her hands as an offensive blast. She can also release the energy from her feet to increase her mobility and allow her to fly.",
    "sourceUrl": "https://bokunoheroacademia.fandom.com/wiki/Nejire_Hado",
    "animeUrl": "https://myanimelist.net/anime/31964/Boku_no_Hero_Academia"
  },
  {
    "name": "Eri",
    "anime": "My Hero Academia",
    "image": "eri.jpg",
    "description": "Eri (壊え理り Eri) is the granddaughter of the Shie Hassaikai's boss. She is also the key source to Kai Chisaki's operation to manufacture a Quirk-Destroying Drug.\n<h2>Appearance</h2>Eri is a small girl with bluish, off-white hair, messy and unkempt, which is parted in the middle of her forehead, almost reaching down to her waist. She has very wide, innocent-looking eyes, which are bright red in color. Poking out from the right side of her forehead is a small, brown horn, which grows larger when her Quirk is activated.\nIn her first appearance, she's wearing a plain, short-sleeved dress, which is a dirty, pale tan color. Bandages are wrapped around both her arms and legs, stopping at her wrists and ankles, underneath which she is shown to have numerous scars.\n<h2>Personality</h2>Because her mother disowned her after she accidentally made her father disappear with her Quirk and the experiments she was subjected to by Kai Chisaki, Eri became a fearful and secluded girl, without anyone showing affection to her in her life. Apparently, Izuku Midoriya's touch was the first time she ever felt kindness, which overwhelmed her. When murderous intents are directed at her, she does not scream, nor cry and simply remains silent, because she knows she has no choice but to accept whatever is to happen to her.\nEri is, however, willing to let herself go with Kai in order to protect those that help her. She feels guilt over other people being hurt in order to rescue her.\n<h2>Quirk</h2>Rewind (巻き戻す Maki Modosu): Eri's Quirk allows her to reverse a living individual's body back to a previous state, allowing her to heal injuries and undo bodily modifications. She has even shown the ability to rewind someone's body to a point before they existed.\nAs a result of her Quirk mutating her body, Eri's blood is able to attack an individual's Quirk and stop its activation.\nThe source of her Quirk's power is located in the horn on her head, and the size of the horn dictates the strength of her power. It is also an accumulation-type Quirk, which means the power it emits has to build up over a period of time before becoming usable.",
    "sourceUrl": "https://bokunoheroacademia.fandom.com/wiki/Eri",
    "animeUrl": "https://myanimelist.net/anime/31964/Boku_no_Hero_Academia"
  },
  {
    "name": "Himiko Toga",
    "anime": "My Hero Academia",
    "image": "himiko_toga.png",
    "description": "Himiko Toga (渡ト我ガ被ヒ身ミ子コ Toga Himiko) is a major antagonist and was a member of the League of Villains, affiliated with the Vanguard Action Squad. Himiko served as one of the main antagonists of the Forest Training Camp Arc, and she is also featured as an antagonist during the Provisional Hero License Exam Arc and the Shie Hassaikai Arc.\nShe later became one of the nine lieutenants of the Paranormal Liberation Front, an organization formed from the remnants of the League and the Meta Liberation Army.\nHimiko currently serves as a commander for the \"Vanguard Action Intelligence Regiment: Carmine\" along with Skeptic.\n<h2>Appearance</h2>Himiko is a relatively petite, fair-skinned girl who is very prone to blushing and is frequently described as having a rather pretty face. She has slightly inward-tilting eyes, irises bright yellow and their pupils thin slits, making them somewhat resemble those of a cat, and her wide mouth is also rather feline, as both her upper and lower canines are more pointed and longer than the rest of her teeth. Her hair is a pale, dirty ash-blonde and is styled into two messy buns, numerous wild strands sticking out at all angles from their centers and where they’re fastened, a straight fringe and two chin-length side bangs to frame her face.\n<h2>Personality</h2>Himiko is a very cheerful girl, to the point of smiling even after having presumably killed someone, displaying apparent sadistic tendencies. This continues even when danger is imminent, as when Tomura Shigaraki was about to attack her, but it tends to stop when she is bored or annoyed. Himiko is frequently seen blushing seemingly out of excitement rather than embarrassment, giving her a permanent look of what appears to be lovesickness on her face. However, she has shown that she can easily be embarrassed, such as when she thinks people are coming on to her, or when she is naked when copying clothes of the people she has transformed into.\n<h2>Quirk</h2>Transform (変へん身しん Henshin): Himiko's Quirk grants her the ability to transform into a physical lookalike of another individual, as well as copy their voice. She can only transform into people whose blood she has ingested. The more blood she drinks, the longer she has access to that person's form. She can switch between the appearances of multiple people if she drinks the blood of more than one person. She can even duplicate a person's clothing, though, her own clothes would overlap the transformation, requiring her to get naked beforehand.\nUpon deactivating her Quirk or switching to another disguise, Himiko's disguise melts into a gray viscous liquid.",
    "sourceUrl": "https://bokunoheroacademia.fandom.com/wiki/Himiko_Toga",
    "animeUrl": "https://myanimelist.net/anime/31964/Boku_no_Hero_Academia"
  },
  {
    "name": "Ishtar",
    "anime": "Fate/Grand Order: First Order",
    "image": "ishtar.gif",
    "description": "Archer (アーチャー, Āchā) is an Archer-class Servant able to be summoned by Ritsuka Fujimaru in the Grand Orders of Fate/Grand Order.\n\nArcher's True Name is Ishtar (イシュタル, Ishutaru), a Pseudo-Servant summoned into the body of Rin Tohsaka.\n\nIshtar is the goddess of beauty, good harvests, war, lust, discord and fertility in Mesopotamian Mythology/Sumerian Mythology/Babylonian Mythology, and one among the many mother goddesses whose power is derived from the Earth Mother. Said to be the most pampered, or rather, the most beloved goddess by the other deities.Her Sumerian divine name was said to be Inanna (イナンナ, Inan'na), and that name is actually her older name. Ishtar is her Akkadian divine name. It means \"The Mistress of Heaven\". A goddess of Venus, a goddess who governs over the good harvests that brings prosperity to the people, and even a goddess who rules over war and destruction, she is a great goddess who, among the goddesses, was presented with many rights and Authorities from the gods. In Sumerian Mythology, she plays an active role as a dynamic goddess and as a goddess who is like the heroine of a story, possessing various anecdotes. Particularly among them, a famous one is her feeding the city of Uruk to a fearsome Divine Beast called the “Bull of Heaven”, seemingly an anecdote that caused the city to be on the brink of destruction; in any case, she is a goddess who is a nuisance to others.\n<h2>Appearance</h2>This form is not that of the goddess Ishtar herself, but a Pseudo-Servant condition in which a human that has a wavelength close to her own was made into a vessel.\n<h2>Personality</h2>In “Fate/Grand Order”, Ishtar has materialized as a Pseudo-Servant by possessing a human. Since Ishtar is egotistical, she behaves without paying any regard to the possessed human, but her nature is receiving a big influence from the human that was possessed. Originally, Ishtar is both deeply compassionate and cruel, but because the personality of the possessed human is more virtuous, her cruelty has retreated to the bottom of her heart, and her good side appears to have come out ahead of it.\nActive and extroverted. The goddess of war and good harvests that lives according to her own whims without being a slave to her own fixed position, all while having high intelligence and pride. Ishtar loves beautiful things, hates ugly things, and the things she desires are the things she absolutely takes hold of in her own hands. Even though she is smart, she is impulsive, and sometimes leaves with an unthinkable reckless abandon. In myths, Ishtar is commented by Gilgamesh as thus: “Inanna Isn’t she the most annoying goddess in the world!? She will destroy something that certainly doesn’t need to be destroyed, and she will also create something that doesn’t need to be created!” If Ishtar becomes ostentatious in this world, then surely in that way, she will invite chaos simultaneously.",
    "sourceUrl": "https://typemoon.fandom.com/wiki/Archer_(Fate/Grand_Order_-_Ishtar)",
    "animeUrl": "https://myanimelist.net/anime/34321/Fate_Grand_Order__First_Order"
  },
  {
    "name": "Lucy Heartfilia",
    "anime": "Fairy Tail",
    "image": "lucy_heartfilia.png",
    "description": "Lucy Heartfilia (ルーシィ・ハートフィリア Rūshi Hātofiria) is a Mage of the Fairy Tail Guild, wherein she is a member of Team Natsu.\n<h2>Appearance</h2>Lucy has brown eyes and shoulder-length blonde hair that is usually tied by ribbons in a variety of colors in a small ponytail to the right side of her head with the rest of the hair loose. However, in the year X791 she appears to keep her hair up more often in pigtails. She is buxom and has a curvaceous body. In X792, her hair is considerably longer, and she keeps it all in a side ponytail.\nHer pink Fairy Tail stamp is located at the back of her right hand. Additionally, Lucy does not consistently wear the same outfit. However, she always has a belt that, along with keeping her skirt up, holds her Celestial Spirit keys and a whip with a heart-shaped end. She often wears black, leather high heeled boots. She also bears a striking resemblance to her mother.",
    "sourceUrl": "https://fairytail.fandom.com/wiki/Lucy_Heartfilia",
    "animeUrl": "https://myanimelist.net/anime/6702/Fairy_Tail"
  },
  {
    "name": "Erza Scarlet",
    "anime": "Fairy Tail",
    "image": "erza_scarlet.png",
    "description": "Erza Scarlet (エルザ・スカーレット Eruza Sukāretto) is an S-Class Mage of the Fairy Tail Guild, wherein she is a member of Team Natsu. She also served as the guild's 7th Guild Master during Makarov's absence in X792.\n<h2>Appearance</h2>Erza is a young woman with long, scarlet hair and brown eyes. She lost her right eye as a child and now has an artificial one which was created by Porlyusica. She has a slender, voluptuous figure that Lucy Heartfilia described as \"amazing.\" Her most common attire consists of a custom-made armor by Heart Kreuz smiths, a blue skirt, black boots, and diamond shaped silver earrings. Her Fairy Tail stamp is blue and is located on the middle of her left upper arm. Erza's specialty in Requip Magic allows her to requip not only armors but different outfits as well, enabling her to change her attire at any given time.\n<h2>Personality</h2>Erza is a very strict person, often criticizing the bad behavior and habits of the other guild members, causing most of them to apologize, fearing that they might invoke her wrath. She is also very impatient, disliking people who don't answer her questions quickly enough. This, coupled with her own tragic childhood, caused many of her guildmates to avoid her due to her social awkwardness. However, she has a great sense of justice and pride in being a member of Fairy Tail.\nErza describes herself as someone who was always crying, since she wasn't able to protect those dear to her. Several examples are when Rob tried to shield her from destruction, and when Jellal was captured because he saved her and was brainwashed by \"Zeref\". Also, Erza has stated that she feels uncomfortable and insecure when she's not wearing armor. However, when Erza encounters Ikaruga, she overcomes her fear and defeats her without her armor.",
    "sourceUrl": "https://fairytail.fandom.com/wiki/Erza_Scarlet",
    "animeUrl": "https://myanimelist.net/anime/6702/Fairy_Tail"
  },
  {
    "name": "Wendy Marvell",
    "anime": "Fairy Tail",
    "image": "wendy_marvell.png",
    "description": "Wendy Marvell (ウェンディ・マーベル Wendi Māberu) is a young female Sky Dragon Slayer. She was one of the orphans chosen to be a Dragon Slayer four hundred years prior to X777, serving as her foster mother's vessel to travel to X777 through the Eclipse Gate as a part of the plan to exterminate Acnologia. Formerly belonging to the Cait Shelter Guild, she officially joins the Fairy Tail Guild after the events surrounding Nirvana unfold. Following the disbandment of Fairy Tail, Wendy, along with Carla, joined Lamia Scale. Subsequent to the conclusion of the war between Orochi's Fin and Lamia Scale, Wendy leaves Lamia Scale and helps Natsu resurrect Fairy Tail.\n<h2>Appearance</h2>Wendy is a petite girl with fair skin. As of her introduction, she has long, dark blue hair that reaches down to her waist, with two bangs framing her face which reach down to her chest alongside her brown eyes. She later cuts her hair down to a bob cut during her battle with Tartaros though Cancer later styled it back into the long hair she usually has after the battle. Like all Dragon Slayers, she has elongated canine teeth. At first, she wears a simple dress with two wavy stripes running across the dress and ending in small pointed edges at the bottom. Around her arms and legs she wears wing like attachments. Wendy's Cait Shelter Guild stamp was located on her right shoulder, but after the Guild disbanded and she joined Fairy Tail, the stamp was replaced by Fairy Tail's Guild stamp.\n<h2>Personality</h2>Wendy is a very shy and polite girl. She is always accompanied by her Exceed companion, Carla, as they have a very close relationship. She is very eager to try and make friends. Wendy also cares greatly for her guild members, and even suggested going to the home-town of the Exceed to try and get them to evacuate when they were under threat.\nShe's initially portrayed as insecure, doubting of both her ability to help her allies and appearance (eg, the sizes of her breasts), however Wendy has become more confident and brave as time goes on, and she always tries to be of help wherever she can. She is intelligent and has a very honest personality, is \"direct and open with her emotions\", and is easily swayed by the people around her. However, this also causes her to be \"very romantic\". She can be spontaneous and \"very ditzy\". Unlike the other Dragon Slayers, Wendy doesn't enjoy fighting, preferring to avoid it as much as possible. If, however, it's for the sake of her guild or friends, Wendy will fight without hesitation. However, after Doranbolt saved her and Carla from dying, with the destruction on one Face, Wendy cut her hair, deciding she would no longer cry and whine, and would continue to fight as long as her friends are fighting as well.",
    "sourceUrl": "https://fairytail.fandom.com/wiki/Wendy_Marvell",
    "animeUrl": "https://myanimelist.net/anime/6702/Fairy_Tail"
  },
  {
    "name": "Nao Tomori",
    "anime": "Charlotte",
    "image": "nao_tomori.png",
    "description": "Nao Tomori (友利 奈緒, Tomori Nao) is one of the main characters of Charlotte. She is a first-year student and the Student Council president of Hoshinoumi Academy. Nao often uses her camcorder to record the power of ability users for proof and is a huge fan of ZHIEND, her older brother's favorite band.\n<h2>Appearance</h2>Nao is a young girl with long grey hair that occasionally appears pale blonde or white throughout the episodes. Her hair is tied in two tails with dark hair ties and has big blue eyes. She is often seen wearing her uniform which consists of a red blazer with a yellow bow tie, and a reddish-brown pleated skirt. Her school uniform also consists of gray knee-length socks with brown boots.\n<h2>Personality</h2>Nao, as part of the student council, is known to be a hardworking, smart, and capable girl; she is also narcissistic, self-righteous, short-tempered and a liar. Nao dislikes when other people fail to acknowledge her efforts. She is bold, straightforward and also loves eating food, especially roasted corn and meat, and she became a great influence on Yū's personality as she was the one who helped him out to recover from his severe depression brought by his younger sister Ayumi's death.\nDue to her past, she claims to not trust anyone but Shunsuke (who isn't named at that point) however as time passes she grows to trust both fellow council members, especially Yu though they still bicker, this trust grows to the point where she believes his claims of time travel and also entrust him with the protection of ability users willingly giving her ability to him.\n<h2>Background</h2>Her brother, who could make air vibrate to his will, was the lead singer and guitarist of a debuting band, after graduating from middle school, she was accepted to the magnet school of a National University, however, due to financial problems, her mother couldn't afford the expenses, so, she had both her children transferred to a boarding school which was secretly run by scientists researching ability wielders, the scientists who ran the school, acknowledged her older brother's supernatural power, and used him as an experimental subject, whenever Nao tried to find her brother, her \"friends\" who were enlisted by the laboratory would try and distract her and pull her away from the truth, when she met her brother a year later he was emotionally destroyed and had gone insane, she then ran away from the school, after that she swore to never trust others.",
    "sourceUrl": "https://charlotte.fandom.com/wiki/Nao_Tomori",
    "animeUrl": "https://myanimelist.net/anime/28999/Charlotte"
  },
  {
    "name": "Kotoko Iwanaga",
    "anime": "Kyokou Suiri",
    "image": "kotoko_iwanaga.png",
    "description": "Kotoko Iwanaga (岩永 琴子, Iwanaga Kotoko) is the main female protagonist of Kyokou Suiri and the current girlfriend of Kuro Sakuragawa. She is known as the \"Goddess of Wisdom.\"\n<h2>Appearance</h2>Kotoko is a young woman with a petite build and doll-like appearance, often mistaken as a young child instead. She has fair skin and purple eyes framed by short, curly blond hair. As a Goddess of Wisdom, she also has only one eye and one leg, with her right eye and left leg being prosthetics. Her glass eye looks identical to her functioning eye, and her prosthetic leg attaches around mid-thigh height.\nHer everyday outfit consists of a white hat with a black ribbon, a white dress with dark blue accents, white socks, brown shoes, and a red cane. The top part of her dress has puffy sleeves and can be taken off independently from the rest of her dress.\n<h2>Personality</h2>She has a very outgoing personality and always makes an effort to find the root of any problem, especially when she has the help of yokai. She is oblivious to danger and she tends to be very clingy when it comes to Kuro.\nKotoko is a self-centered, unrepentant prankster, who enjoys poking fun at others expense, and is also a bit of a pervert. She is also shown to have a rather childish demeanor whenever she feels she is not given enough attention or proper treatment, which is aimed especially at Kuro, to whom she can be very pushy.",
    "sourceUrl": "https://kyokousuiri.fandom.com/wiki/Kotoko_Iwanaga",
    "animeUrl": "https://myanimelist.net/anime/39017/Kyokou_Suiri"
  },
  {
    "name": "Inori Yuzuriha",
    "anime": "Guilty Crown",
    "image": "inori_yuzuriha.png",
    "description": "Inori Yuzuriha was the female protagonist of Guilty Crown and a member of the resistance guerrilla group called \"Funeral Parlor\". She was the voice of the internet artist Egoist.\n<h2>Personality</h2>Inori is first shown to be emotionless and only cares to follow Gai's orders. Inori was made by GHQ to \"contain Mana's mind\", and Gai was the one who woke her up and gave her a name. Thus, she shows absolute respect and devotion towards him. She is very quiet, rarely saying anymore than necessary. However, she does have her own opinions; when Shu is beating himself up over the idea that nobody would ever choose him over Gai, she tells him to stop it, saying she hates people feeling sorry for themselves. She then allows Shu to see Gai's vulnerable side, with the hopes that the two would settle their differences. Inori is also shown to be a somewhat cold-blooded person; being able to kill enemies without much hesitation, though she also gives them a warning beforehand.\nAfter meeting and living with Shu, Inori gradually becomes more emotional, smiling a lot more and even showing embarrassment when she gets too close to Shu. While she initially tells Shu that she belongs to him because Gai told her to, overtime her declaration becomes genuine. However, she is shown to have cared about him even before telling him the truth, as when Shu got captured by the GHQ, she felt very cold and didn't know why. She would later tell Tsugumi that was the only time she ever felt lonely. In general, Inori is often shown not to understand her own emotions, to the point that she has to be directly told by Gai that she loves Shu. Overtime, she becomes a much friendlier and more open person, not only to Shu, but to everyone around her.\n<h2>Appearance</h2>Inori was a beautiful girl with light pink hair that ombres into hot pink and is tied into pigtails, she tied her hair using two tubes, and had a small red clip on the left side of her face. Inori had red eyes, she was about 166cm tall with small glossed lips. She looked very fragile, having a very slender figure and thin legs. Her usual fighting attire is a red leotard with the middle mostly cut out, red-orange spoilers with flowers on the side and high red gloves. She also wears a black short dress with white lining on the bottom and red ribbons on the bottom, which she wears it when she is not fighting. When attending school, she wears the standard school uniform. She also wears a white outfit in place of her red flowery leotard outfit.",
    "sourceUrl": "https://guiltycrown.fandom.com/wiki/Inori_Yuzuriha",
    "animeUrl": "https://myanimelist.net/anime/10793/Guilty_Crown"
  },
  {
    "name": "Miku Nakano",
    "anime": "The Quintessential Quintuplets",
    "image": "miku_nakano.png",
    "description": "Miku Nakano (中なか野の 三み玖く, Nakano Miku) is the third sister of the Nakano Quintuplets, and one of the main characters of the 5-toubun no Hanayome series. She has a timid personality.\n<h2>Appearance</h2>Miku is an emotionless looking girl with medium-length brownish-red hair that has strands of hair hanging over the right side of her face. Her notable accessory is a set of wireless headphones that have a triangle-shaped logo on the ear cups (Audio-Technica). Like her sisters, she has dark blue eyes, an average height, a well-endowed figure and large breasts.\nMiku usually wears a long-sleeved sweater that covers her uniform. She also wears black tights and puts on her headphones around her neck. Most of the time, she has part of her bangs cover her right eye. She wears a ranzel.\n<h2>Personality</h2>Miku is a silent and reserved girl who has a pessimistic way of thinking and low confidence, even to the point of belittling herself. Fuutarou Uesugi notes that she doesn't have faith in herself. In contrary to her reserved self, she can talk in a straightforward manner and doesn't hesitate to confront others.\nIt is shown that she has an obsession with generals from the Sengoku Period. She is greatly influenced by their philosophies, to the point of affecting her real-life behavior. She hides this fact from her everyone and is embarrassed when Fuutarou found out. When Fuutarou challenged her to a duel of historical knowledge, she donned a set of armour similar to Takeda Shingen's.\nDespite her slightly negative outlook on life, such as when she asks Fuutarou to give up on her, she is the first sister to abide by the Gotoubun Principle. Miku always reminds herself to follow this principle, going as far as compromising her own interest to make sure everyone is treated equally.",
    "sourceUrl": "https://5hanayome.fandom.com/wiki/Miku_Nakano",
    "animeUrl": "https://myanimelist.net/anime/38101/5-toubun_no_Hanayome"
  },
  {
    "name": "Ichika Nakano",
    "anime": "The Quintessential Quintuplets",
    "image": "ichika_nakano.png",
    "description": "Ichika Nakano (中なか野の 一いち花か, Nakano Ichika) is one of the main characters of the 5-toubun no Hanayome series. She is the first sister of the Nakano Quintuplets who took the role of the eldest sister properly as she is trusted enough to act as their confident and leader, despite the negligible age difference among them, she aspires to become an actress and likes to tease Fuutarou Uesugi (Ichika's tutor).\n<h2>Appearance</h2>Ichika is a girl with very short hair that has a single long strand on the right side. She has white-pink hair colour, ranging from oyster pink to light pink shade in Volume 1, and oyster white to light pink shade in Volume 4. Her notable accessory is a single earring. Like her sisters, she has dark blue eyes, an average height, a well-endowed figure and large breasts. A stall owner praises Ichika for her cuteness, but she doesn't praise her sister nearby, Itsuki Nakano.\nIchika wears her school uniform with a thin jacket tied to her waist, sometimes with unbuttoned top; revealing her cleavage. She is shown to wear a handbag.\n<h2>Personality</h2>Ichika acts as the eldest sister of her sisters, as she seems to have a calm and composed demeanor; making herself an approachable person. Fuutarou Uesugi noted that her smile is fake and encourage her to put away that kind of smile.\nShe initially had pessimistic attitude towards the sisters' learning capabilities, making her one of the obstacles for Fuutarou tutoring lessons early in the story. After being inspired by him, she began to change her mind and started to take studying seriously. He also helped her fix any issues she had with her sisters; making them closer than ever before. Despite her smug expression and teasing behaviour, Ichika is shown to have a weakness to romantic moments happening to her; blushing whenever thoughts about it came to her mind.",
    "sourceUrl": "https://5hanayome.fandom.com/wiki/Ichika_Nakano",
    "animeUrl": "https://myanimelist.net/anime/38101/5-toubun_no_Hanayome"
  },
  {
    "name": "Nino Nakano",
    "anime": "The Quintessential Quintuplets",
    "image": "nino_nakano.png",
    "description": "Nino Nakano (中なか野の 二に乃の, Nakano Nino) is one of the main characters of the 5-toubun no Hanayome series. She is the second sister of the Nakano Quintuplets who usually acts as the mother of the family; cooking for them and taking care of their medical needs. Among the five sisters, she is the one who has the highest hostility towards Fuutarou Uesugi and often rebelled against him early in the series.\n<h2>Appearance</h2>Nino is a cute and cold-looking girl with waist-length or hip-length straight hair (but it is later cut to shoulder-length in Vol. 4 Ch. 46 and shown in Vol. 5 Ch. 47) that has square bangs hanging over her eyebrows. She has reddish-pink hair, ranging from light pink to telemagenta in Volume 1 and antique pink to red-violet in Volume 4.\nHer notable accessories are twin butterfly-shaped ribbons on both sides of her head. Like her sisters, she has dark blue eyes, an average height, a well-endowed figure and large breasts. She wears a long-sleeved sweater that covers her uniform and a pair of white thigh-high socks. Both her and Ichika Nakano use a handbag.\nShe is noted to be the more fashionable girl among the sisters, as she has various cute accessories and takes care of her nails. Her ears have yet to be pierced, but she plans to have them at least before marriage.\n<h2>Personality</h2>Nino has an outgoing personality and is socially aware, resulting in her having many friends and is a social butterfly. She has a sharp tongue and talks bluntly when confronting others, even to her sisters. Her rebellious attitude makes her the least cooperative girl among the sisters, making her archetype resemble that of a \"tsundere\".\nDespite the cold and rude front, Nino is caring and protective, like when she is touched by Fuutarou Uesugi's past; remarking that it is tearjerking. It is also evident by her willingness to act as the cook of the family, ignoring her care towards her own appearance (culinary activities may lead to foul odor, damaged nails, etc.). She is also shown to always have band-aids with her, possibly as a precaution to Yotsuba Nakano's active behavior.\nHer interests seem to lie more on romance than anything else. An example is when she wanted to watch a romance movie, whilst Itsuki Nakano preferred a science documentary instead. With this is mind, she likes to openly state her feelings for Fuutarou, regardless of whether it's in front of him or her sisters.\nAccording to Fuutarou, each Nakano Quintuplet has their own characteristics regarding their sheets, but in Nino's case, she will file her papers neatly.",
    "sourceUrl": "https://5hanayome.fandom.com/wiki/Nino_Nakano",
    "animeUrl": "https://myanimelist.net/anime/38101/5-toubun_no_Hanayome"
  },
  {
    "name": "Itsuki Nakano",
    "anime": "The Quintessential Quintuplets",
    "image": "itsuki_nakano.png",
    "description": "Itsuki Nakano (中なか野の 五月いつき, Nakano Itsuki) is the fifth sister of the Nakano Quintuplets, and one of the main characters of the 5-toubun no Hanayome series. Itsuki is serious and diligent, yet also a glutton and crybaby.\n<h2>Appearance</h2>Itsuki is a serious looking girl with medium-length hair and an expressive ahoge. She has reddish-orange hair colour, ranging from light pink to salmon pink in Volume 1, and deep orange to orient red in Volume 4. Her notable accessories are a pair of star-shaped hairpins, which Fuutarou Uesugi called unfashionable at one point, near both of her eyes. Like her sisters, she has dark blue eyes, an average height, and a well-endowed figure. In class, or when she does activities that involve studying, she wears glasses.\nItsuki is noted to be \"cute\" by her classmates and she looks very similar to Rena Nakano, according to Shimoda.\nShe wears her uniform normally without any accessories, like most of the girl students, and on occasion, she wears a handbag.\n<h2>Personality</h2>Itsuki is a serious and earnest girl who usually wakes up early compared to her sisters. She is well-manned; never being late or missed a class, and always speaks politely. Nino, her sister, comments that Itsuki is too straight-laced.\nItsuki is a girl who bears grudges, as shown when she rejects Fuutarou Uesugi's tutoring partly because of a previous quarrel they had. She is also someone who can't be honest with herself and has difficulties being more straightforward. Both of these qualities often make her struggle on her own. She is often a wimp, be it about unfavourable situations, scary things or her stubborn self.\nShe has a huge appetite and is mostly seen eating something throughout the series. It appears that she doesn't mind treating her sisters unfairly when it comes to food-related topics. This shows where during one scenario when she proposed to her sisters to share their cakes; suspected to sample all the flavours by Ichika.",
    "sourceUrl": "https://5hanayome.fandom.com/wiki/Itsuki_Nakano",
    "animeUrl": "https://myanimelist.net/anime/38101/5-toubun_no_Hanayome"
  },
  {
    "name": "Yotsuba Nakano",
    "anime": "The Quintessential Quintuplets",
    "image": "yotsuba_nakano.png",
    "description": "Yotsuba Nakano (中なか野の 四よつ葉ば, Nakano Yotsuba) is the fourth sister of the Nakano Quintuplets, and one of the main characters of the 5-toubun no Hanayome series. Having an cheerful and energetic personality, she has a strong tendency of helping people out.\nYotsuba and her sisters used to enroll at the Black Rose Girls School, thanks to the influence of their stepfather, Maruo Nakano. However, an unfortunate incident prompted them to transfer to Asahiyama High School, where Yotsuba served as the representative of class 3-1 in her last high school year.\n<h2>Appearance</h2>Yotsuba has short, straight hair that stops just around her neck. She is portrayed to have light orange hair colour throughout Volume 1-4. Her notable accessory is a bunny ear-shaped ribbon, which can change forms depending on her emotions. Like her sisters, she has dark blue eyes, an average height, a well-endowed figure, and large breasts.\nYotsuba wears her uniform with a large butterfly-shaped tie and wears a sports bag. When at her home. she uses small-shaped pajama's.\n<h2>Personality</h2>Yotsuba is an active, cheerful and easygoing girl. She talks in a loud, spontaneous and sometimes absent-minded manner. She is the type of person who can't say no to people who need help and is mostly seen helping others; either directly and indirectly.\nWhile cheerful on the outside and towards others, she harbours feelings of inferiority towards her sisters and her own abilities. Because of this, she grew a desire to be different from sisters. She shortened her hair, put on a ribbon and excelled in extra-curricular activities. While portrayed as a bad liar early on, she is later shown to have some skill in lying herself.",
    "sourceUrl": "https://5hanayome.fandom.com/wiki/Yotsuba_Nakano",
    "animeUrl": "https://myanimelist.net/anime/38101/5-toubun_no_Hanayome"
  },
  {
    "name": "Sayu Ogiwara",
    "anime": "Hige wo Soru. Soshite Joshikousei wo Hirou",
    "image": "sayu_ogiwara.jpg",
    "description": "Sayu Ogiwara (荻原 沙優, Ogiwara Sayu) is the main female character of the Hige wo Soru. Soshite Joshikousei wo Hirou. series. She is a runaway high school girl from Hokkaido who ended up in Tokyo. One night, while squatting beneath a lamppost, she had a fateful encounter with a drunk salaryman named Yoshida.\n<h2>Appearance</h2>Sayu is a beautiful young girl with fairly cute face. Her hair is a shade of brown close to black and has brown eyes with long slits. She has a pretty nose line with a round tip. Yoshida considers her face as somewhere between \"beautiful\" and \"cute.\"\nAlthough still quite young, she has the features of a grown woman. Since leaving her hometown, she only has her high school uniform and brown sweater as her clothes, a set of black lingerie and a blue backpack. After moving in and living with Yoshida, she now wears new outfits but still puts on her old uniform occasionally. When working at FamilyMarket, she wears the staff uniform.\n<h2>Personality</h2>After running away from her hometown and family, Sayu was forced to adapt and live her new life as a runaway high school girl. With no money to sustain her basic needs like food and shelter, she gathered her resolve and resorted into seducing men, using her body as a bargaining chip in order to survive.\nAs she kept this lifestyle for about half a year, she became shrewd and adopted a playful, flirty mask to hide her pain and used her bright smile for deceit. To mask her identity, she used aliases. She also developed a high level of maturity and strong mental fortitude, traits which are uncommon for a normal high school girl to have at her age.\nSayu hated what she was doing at first, but after a while, being wanted by the men she was with made her feel she could be herself and that she was needed. For her, it was simple and she liked it that way. Because she was already used to that kind of arrangement, she was conflicted when Yoshida let her stay without any significant demands. She doesn't know what to do if people do not want her.\nSayu dislikes facing things in a straightforward way. She would do what she can just to delay things she does not want to deal with. All she wants to do is running away from everything, to live an easier life but at the same time she yearns for someone to scold her and tell her to stop running. Through the help of Yoshida and Airi to name a few, she had come to terms with herself and her issues, finally deciding to face the reality; that she has to return back home.\n<h2>Background</h2>Sayu is the 17-year-old daughter of the Ogiwara Family, a prominent family hailing from the city of Asahikawa, Hokkaido. Her older brother, Issa Ogiwara, is currently a CEO of a famous food corporation. She was a second-year high school student at Asahikawa Dairoku High School when she ran away from home for unknown reasons. For six months, she continually traded sexual favors to random strangers for a place to stay. She ended up in Tokyo and had her fateful encounter with Yoshida, a 26-year-old salaryman and the first one to turn down her advances.",
    "sourceUrl": "https://higehiro.fandom.com/wiki/Sayu_Ogiwara",
    "animeUrl": "https://myanimelist.net/anime/40938/Hige_wo_Soru_Soshite_Joshikousei_wo_Hirou"
  },
  {
    "name": "Zero Two",
    "anime": "Darling in the FranXX",
    "image": "zero_two_best_girl.png",
    "description": "Zero Two (ゼロツー, Zero Tsū) is the main heroine and deuteragonist of DARLING in the FRANXX. She is a human-klaxo sapien hybrid and a member of the APE Special Forces, primarily fighting on the front lines. As an elite Parasite with the codename \"002\", also known as the \"Partner Killer\", Zero Two had always accepted solitude due to her horns and Klaxosaur blood. Despite having no regard for human life or her own and being accustomed to fighting solo, she took interest in Hiro and offered an opportunity to pilot with her, making him her new partner and \"darling\". After Hiro was able to ride with her more than three times, the pair became the 13th Plantation's newest members, piloting the powerful FRANXX Strelizia.\n<h2>Appearance</h2>As a child, Zero Two looked much more like a monster, with red skin, long sharp nails, and fanged teeth. While her eye colour was the same, her sclera was red instead of white. Her horns were also much larger in comparison to her head, and her hair was a lighter shade of pink. In terms of clothes all she was given was a dark grey cloak, and white wrappings from Hiro that substituted for shoes.\nGrowing up, Zero Two developed a fair complexion. She had a slender and athletic figure; she was the tallest girl in the squad and even taller than most of the boys as well. She had waist-length, long pink hair with straight bangs covering her forehead and a pair of red horns on her head and a white limiter headband over her horns. She had sharp, turquoise eyes with rings around the pupils and pinkish-red markings on the canthi.\n<h2>Personality</h2>Since childhood, Zero Two had been alone due to her Klaxosaur blood, always being seen as a \"monster\". The way people treated her as a child made her lose faith in people which is especially seen when she was a child: being very defensive or aggressive when people tried to interact with her. Besides that, Zero Two acted like a wild animal or a feral child, eating with her hands, growling, making other vocal noises instead of speaking and chasing after mice that were near her. However, Zero Two was also shown to a fairly cheerful, curious, and happy girl, and it was during her time with Hiro that shaped much of her personality and quirks in the present, such as her sweet tooth, the way she referred to herself as (\"Boku\"), and the nickname she had for Hiro, \"Darling\". Because Hiro treated her as he would anyone else, whereas others didn't treat her as a human for one reason or another, Zero Two developed a deep admiration and liking towards him. Despite having her memories of the darling from her childhood erased, Zero Two retained some fragmented memories which was why she strived to become human no matter what.\n",
    "sourceUrl": "https://darling-in-the-franxx.fandom.com/wiki/Zero_Two",
    "animeUrl": "https://myanimelist.net/anime/35849/Darling_in_the_FranXX"
  }
]
