[
  {
    "name": "Tomoko Kuroki",
    "anime": "Watamote",
    "image": "tomoko.png",
    "description": "Socially inept and often desperate, the series chronicles her various attempts to try to be more popular at her school, Makuhari Shuuei High School. She is 15 years old at the time of the series' debut and was born towards the end of February of either 1994, 1997, or 1998.\n\nTomoko started off very excited about high school. After all, she had had over 50 years of dating experience with over 100 boys in otome games, and she could not have been more enthralled with the years of popularity her secondary education was bound to bring! However, after going two months without speaking to anyone in her class, Tomoko is baffled by her continuing lack of notoriety and becomes more determined than ever to gain her peers' approval. In both the manga and anime, Tomoko debuts looking up the definition of \"unpopular girl\"--\"mojyo\" spelled in the English titles later--on the internet only to discover she fits all of the criteria! In the anime opening titles, she is depicted as a prisoner having her pictures taken wearing a placard that identifies her as \"mojyo\" in English letters.\n\nTomoko has a grim outlook on life - so much that during a daydream she imagines herself on a motorcycle, only to crash and end up in the hospital. She utters a \"censored\" with a tone reference to the anime Gantz, hoping her world will be destroyed and replaced. As the initial series progresses, Tomoko tries to become popular by coming up with ideas on how to get attention. She usually either fails or receives negative attention. She often lacks a \"filter\" in that she will say what she thinks without considering the consequences.",
    "sourceUrl": "https://watamote.fandom.com/wiki/Tomoko_Kuroki",
    "animeUrl": "https://myanimelist.net/anime/16742/Watashi_ga_Motenai_no_wa_Dou_Kangaetemo_Omaera_ga_Warui"
  },
  {
    "name": "Chika Fujiwara",
    "anime": "Kaguya-samawa Kokurasetai",
    "image": "chika.gif",
    "description": "Chika is based off of Kuramochi no Miko (車持 皇子), the second suitor from The Tale of the Bamboo Cutter who was tasked with finding the Jeweled Branch from Hourai. Her habit of cheating during games is based off of the fact that her counterpart attempted to present Princess Kaguya with a forgery. Everyone in her family has plant based names that reference the branch in some way.",
    "sourceUrl": "https://kaguyasama-wa-kokurasetai.fandom.com/wiki/Chika_Fujiwara",
    "animeUrl": "https://myanimelist.net/anime/37999/Kaguya-sama_wa_Kokurasetai__Tensai-tachi_no_Renai_Zunousen"
  },
  {
    "name": "Shiro",
    "anime": "No Game No Life",
    "image": "shiro.jpg",
    "description": "Abandoned by her parents, Shiro is an 11 year old genius NEET (Not in Education, Employment, or Training) hikikomori (shut-in) gamer who, along with her step-brother, Sora, form 『　　』 (Blank). Sora's dad married Shiro's mother, both having remarried, thus making Shiro and Sora step-siblings.",
    "sourceUrl": "https://no-game-no-life.fandom.com/wiki/Shiro",
    "animeUrl": "https://myanimelist.net/anime/19815/No_Game_No_Life"
  },
  {
    "name": "Takagi-san",
    "anime": "Karakai Jōzu no Takagi-san",
    "image": "takagi.jpg",
    "description": "She is a middle school student who is in the same class as Nishikata, a boy she constantly teases and secretly has feelings for. She is sweet, intelligent, clever, carefree, and fearless whether she is with or without Nishikata. After the 10 year time skips, she is shown to be more mature and responsible for her daughter Chi and the household she and Nishikata live in.",
    "sourceUrl": "https://karakai-jouzu-no-takagi-san.fandom.com/wiki/Takagi",
    "animeUrl": "https://myanimelist.net/anime/35860/Karakai_Jouzu_no_Takagi-san"
  }
]